{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}30 Mar 2022, 10:41:01
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 3.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. ** Prepares Table 3
. * Table 3: Top 10 level 3 causes of DALYs, YLDs and YLLs in 1990 and 2019 by sex, 
. * all ages and age-standardized.
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 3 Part 1: DALYs, All ages
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part1")
. 
. ** Table 3 Part 2: DALYs, Age-standardized
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part2")
. 
. ** Table 3 Part 3: YLLs, All ages
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part3")
. 
. ** Table 3 Part 4: YLLs, Age-standardized
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part4")
. 
. ** Table 3 Part 5: YLDs, All ages
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part5")
. 
. ** Table 3 Part 6: YLDs, Age-standardized
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3.xlsx", sheet("Part6")
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part1
. 
. * Top 10 level 3 causes of DALYs in 1990 and 2019 by sex, All ages 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-31.csv", clear 
{res}{text}(16 vars, 11,152 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-31.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/58b240731c27fc1c0d876614e96818d9
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: All Ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: level 3 causes (169 causes)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. drop measure_id location_id location_name age_id metric_id metric_name
{txt}
{com}. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(4,040 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(3,976 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(3,136 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(11,152 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(4,040 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(3,136 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(3,976 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(11,152 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(5,584 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(5,568 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(11,152 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(3,752 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(3,676 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(3,724 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(11,152 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(3,752 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(3,676 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(3,724 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(10,038 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(10,038 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(10,030 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort measure_id sex_id_new age_id_new Year cause_id
{txt}
{com}. 
. drop sex_id     measure_id_new sex_id_new age_id_new
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. 
. * gen Sex-Year combinations
. 
. egen Sex_Year = group(Sex Year), lname(name)
{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. order cause_id, last
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31.dta", replace
{txt}file IHME-GBD_2019_DATA-31.dta saved

{com}. 
. 
. * for DALYs 1990 and 2019 All Ages
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "DALYs"
{txt}(3,556 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(1,006 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(954 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", replace sheet("Part1") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part1") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs 
> 
> Both sexes      Males   Females
> 
> All ages        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part2
. 
. * Top 10 level 3 causes of DALYs in 1990 and 2019 by sex, Age-standardized
. 
. 
. use "IHME-GBD_2019_DATA-31.dta", clear
{txt}
{com}. * See Metadata above
. 
. * for DALYs 1990 and 2019 Age-standardized
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "DALYs"
{txt}(3,556 observations deleted)

{com}. 
. keep if Age == "Age-standardized"
{txt}(1,014 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(946 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", sheet("Part2") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part2") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part3
. 
. * Top 10 level 3 causes of YLLs in 1990 and 2019 by sex, All ages
. 
. 
. use "IHME-GBD_2019_DATA-31.dta", clear
{txt}
{com}. * See Metadata above
. 
. * for DALYs 1990 and 2019 All ages
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "YLLs"
{txt}(4,008 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(784 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(724 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", sheet("Part3") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part3") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> YLLs 
> 
> Both sexes      Males   Females
> 
> All Ages        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part4
. 
. * Top 10 level 3 causes of YLLs in 1990 and 2019 by sex, Age-standardized
. 
. 
. use "IHME-GBD_2019_DATA-31.dta", clear
{txt}
{com}. * See Metadata above
. 
. * for YLLs 1990 and 2019 Age-standardized
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "YLLs"
{txt}(4,008 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(784 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLLs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(724 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", sheet("Part4") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part4") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> YLLs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part5
. 
. * Top 10 level 3 causes of YLDs in 1990 and 2019 by sex, All ages
. 
. 
. use "IHME-GBD_2019_DATA-31.dta", clear
{txt}
{com}. * See Metadata above
. 
. * for DALYs 1990 and 2019 All ages
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "YLDs"
{txt}(3,588 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(994 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(934 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", sheet("Part5") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part5") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> YLDs 
> 
> Both sexes      Males   Females
> 
> All Ages        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part6
. 
. * Top 10 level 3 causes of YLDs in 1990 and 2019 by sex, Age-standardized
. 
. 
. use "IHME-GBD_2019_DATA-31.dta", clear
{txt}
{com}. * See Metadata above
. 
. * for YLDs 1990 and 2019 Age-standardized
. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}.         
. keep if Measure == "YLDs"
{txt}(3,588 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(994 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(934 observations deleted)

{com}. 
. export excel using "Table 3.xlsx", sheet("Part6") firstrow(varlabels) 
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. /* "Table 3.xlsx", sheet("Part6") contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> YLDs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> top 10 level 3 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 3.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}30 Mar 2022, 10:41:02
{txt}{.-}
{smcl}
{txt}{sf}{ul off}