{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Oct 2023, 20:40:11
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 3.do"
. 
. * Project: Canada Burden of Disease 1990-2019                                                                        
. * Person: Farshad Pourmalek
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 3
. * Table 3: Relative (%) changes in age-standardized DALY rates 
. * in Canada and comparator high-income locations for major groups of conditions, 1990-2019
. * , with a 95% uncertainty interval
. 
. * level 2 causes, % change in Age-standardized DALYs rate in each of 5 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 3 : Level 2 Grouping of Conditions, % change in values 1990-2019
. * Input data: "IHME-GBD_2019_DATA-51.csv"
. * Output data: "Table 4 Part1.dta"
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3
. 
. ** Prepares Table 3, Level 2 Grouping of Conditions
. * Table 4: Relative (%) changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canadaâ€™s rank in 1990-2019 among all high-income countries. 
. 
. * level 2 causes, % change in Age-standardized DALYs rate in each of 5 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-53.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(17 vars, 108 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-53.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/6db6961bfbc56bc8b68e9c14755d6313
> 
> Data settings:
> 
> Base: Change
> Location: 6 groups of countries (See "do Table 4 a.do")
> Year range: 1990-2010
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: DALYs
> Sex: Male, Female, Both
> Cause: level 2
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> 
> * Countries in Table 4:
> 
> see "do Table 4 a.do"
> 
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. 
. replace Cause = "Maternal & neonatal" if Cause == "Maternal and neonatal disorders"
{txt}(6 real changes made)

{com}. replace Cause = "Respiratory infections" if Cause == "Respiratory infections and tuberculosis"
{txt}(6 real changes made)

{com}. replace Cause = "Neoplasms" if Cause == "Neoplasms"
{txt}(0 real changes made)

{com}. replace Cause = "Cardiovascular" if Cause == "Cardiovascular diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Chronic respiratory" if Cause == "Chronic respiratory diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Digestive" if Cause == "Digestive diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Neurological" if Cause == "Neurological disorders"
{txt}(6 real changes made)

{com}. replace Cause = "Mental" if Cause == "Mental disorders"
{txt}(6 real changes made)

{com}. replace Cause = "Substance use" if Cause == "Substance use disorders"
{txt}(6 real changes made)

{com}. replace Cause = "Diabetes & kidney" if Cause == "Diabetes and kidney diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Skin" if Cause == "Skin and subcutaneous diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Sense organ" if Cause == "Sense organ diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Musculoskeletal" if Cause == "Musculoskeletal disorders"
{txt}(6 real changes made)

{com}. replace Cause = "Other NCD" if Cause == "Other non-communicable diseases"
{txt}(6 real changes made)

{com}. replace Cause = "Transport injuries" if Cause == "Transport injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Unintentional injuries" if Cause == "Unintentional injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Self-harm and violence" if Cause == "Self-harm and interpersonal violence"
{txt}(6 real changes made)

{com}. 
. gen cause_id_new = .
{txt}(108 missing values generated)

{com}. replace cause_id_new = 1 if Cause == "Maternal & neonatal"
{txt}(6 real changes made)

{com}. replace cause_id_new = 2 if Cause == "Respiratory infections"
{txt}(6 real changes made)

{com}. replace cause_id_new = 3 if Cause == "Neoplasms"
{txt}(6 real changes made)

{com}. replace cause_id_new = 4 if Cause == "Cardiovascular"
{txt}(6 real changes made)

{com}. replace cause_id_new = 5 if Cause == "Chronic respiratory"
{txt}(6 real changes made)

{com}. replace cause_id_new = 6 if Cause == "Digestive"
{txt}(6 real changes made)

{com}. replace cause_id_new = 7 if Cause == "Neurological"
{txt}(6 real changes made)

{com}. replace cause_id_new = 8 if Cause == "Mental"
{txt}(6 real changes made)

{com}. replace cause_id_new = 9 if Cause == "Substance use"
{txt}(6 real changes made)

{com}. replace cause_id_new = 10 if Cause == "Diabetes & kidney"
{txt}(6 real changes made)

{com}. replace cause_id_new = 11 if Cause == "Skin"
{txt}(6 real changes made)

{com}. replace cause_id_new = 12 if Cause == "Sense organ"
{txt}(6 real changes made)

{com}. replace cause_id_new = 13 if Cause == "Musculoskeletal"
{txt}(6 real changes made)

{com}. replace cause_id_new = 14 if Cause == "Other NCD"
{txt}(6 real changes made)

{com}. replace cause_id_new = 15 if Cause == "Transport injuries"
{txt}(6 real changes made)

{com}. replace cause_id_new = 16 if Cause == "Unintentional injuries"
{txt}(6 real changes made)

{com}. replace cause_id_new = 17 if Cause == "Self-harm and violence"
{txt}(6 real changes made)

{com}. 
. 
. 
. drop if Cause == "Enteric infections"
{txt}(0 observations deleted)

{com}. drop if Cause == "HIV/AIDS and sexually transmitted infections"
{txt}(0 observations deleted)

{com}. drop if Cause == "Neglected tropical diseases and malaria"
{txt}(0 observations deleted)

{com}. drop if Cause == "Nutritional deficiencies"
{txt}(6 observations deleted)

{com}. drop if Cause == "Other infectious diseases"
{txt}(0 observations deleted)

{com}. 
. 
. 
. 
. gen Sex = ""
{txt}(102 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(102 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(0 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(0 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(102 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(102 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(0 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(0 real changes made)

{com}. 
. 
. * gen percent = proportion * 100
. replace val = val * 100
{txt}(102 real changes made)

{com}. replace upper = upper * 100
{txt}(102 real changes made)

{com}. replace lower = lower * 100
{txt}(102 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(102 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(102 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(102 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}.         
. order sex_id cause_id year_start year_end, last
{txt}
{com}. 
. order Sex, after(age_name)
{txt}
{com}. 
. rename location_name Location
{res}{txt}
{com}. 
. order Measure age_name, last
{txt}
{com}. 
. sort Location Sex cause_id_new
{txt}
{com}. 
. sort sex_id_new 
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. keep if year_start == 1990 & year_end == 2019
{txt}(0 observations deleted)

{com}. 
. keep Location Sex Cause Value Lower_UL Upper_UL cause_id_new 
{txt}
{com}. 
. keep if Sex == "Both sexes"
{txt}(0 observations deleted)

{com}. 
. drop Sex
{txt}
{com}. 
. replace Location = "United_States" if Location == "United States of America"
{txt}(17 real changes made)

{com}. replace Location = "Asia_Pacific" if Location == "High-income Asia Pacific"
{txt}(17 real changes made)

{com}. replace Location = "Western_Europe" if Location == "Western Europe"
{txt}(17 real changes made)

{com}. replace Location = "Western_Europe" if Location == "Western Europe"
{txt}(0 real changes made)

{com}. replace Location = "Southern_Latin" if Location == "Southern Latin America" // Southern_Latin_America
{txt}(17 real changes made)

{com}. 
. 
. gen location_id_new = .
{txt}(102 missing values generated)

{com}. replace location_id_new = 1 if Location == "Canada"
{txt}(17 real changes made)

{com}. replace location_id_new = 2 if Location == "United_States"
{txt}(17 real changes made)

{com}. replace location_id_new = 3 if Location == "Western_Europe"
{txt}(17 real changes made)

{com}. replace location_id_new = 4 if Location == "Australasia"
{txt}(17 real changes made)

{com}. replace location_id_new = 5 if Location == "Asia_Pacific"
{txt}(17 real changes made)

{com}. replace location_id_new = 6 if Location == "Southern_Latin" // Southern_Latin_America
{txt}(17 real changes made)

{com}. 
. sort location_id_new cause_id_new
{txt}
{com}. 
. reshape wide Value Lower_UL Upper_UL location_id_new, i(Cause) j(Location) string
{txt}(j = Asia_Pacific Australasia Canada Southern_Latin United_States Western_Europe)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}         102   {txt}->   {res}17          
{txt}Number of variables        {res}           7   {txt}->   {res}26          
{txt}j variable (6 values)          {res}Location   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}ValueAsia_Pacific ValueAustralasia ... ValueWestern_Europe
                               Lower_UL   {txt}->   {res}Lower_ULAsia_Pacific Lower_ULAustralasia ... Lower_ULWestern_Europe
                               Upper_UL   {txt}->   {res}Upper_ULAsia_Pacific Upper_ULAustralasia ... Upper_ULWestern_Europe
                        location_id_new   {txt}->   {res}location_id_newAsia_Pacific location_id_newAustralasia ... location_id_newWestern_Europe
{txt}{hline 77}

{com}. 
. sort cause_id_new
{txt}
{com}. 
.     
. rename ///
> (ValueCanada ValueUnited_States ValueWestern_Europe ValueAustralasia ValueAsia_Pacific ValueSouthern_Latin) ///
> (Canada_Value United_States_Value Western_Europe_Value Australasia_Value Asia_Pacific_Value Southern_Latin_Value)
{res}{txt}
{com}. 
. order Cause Canada_Value United_States_Value Western_Europe_Value Australasia_Value Asia_Pacific_Value Southern_Latin_Value
{txt}
{com}. 
. drop location_*
{txt}
{com}. 
. rename (Lower_ULCanada Upper_ULCanada) (Canada_Lower_UL Canada_Upper_UL)
{res}{txt}
{com}. rename (Lower_ULUnited_States Upper_ULUnited_States) (United_States_Lower_UL United_States_Upper_UL)
{res}{txt}
{com}. rename (Lower_ULWestern_Europe Upper_ULWestern_Europe) (Western_Europe_Lower_UL Western_Europe_Upper_UL)
{res}{txt}
{com}. rename (Lower_ULAustralasia Upper_ULAustralasia) (Australasia_Lower_UL Australasia_Upper_UL)
{res}{txt}
{com}. rename (Lower_ULAsia_Pacific Upper_ULAsia_Pacific) (Asia_Pacific_Lower_UL Asia_Pacific_Upper_UL) 
{res}{txt}
{com}. rename (Lower_ULSouthern_Latin Upper_ULSouthern_Latin) (Southern_Latin_Lower_UL Southern_Latin_Upper_UL)
{res}{txt}
{com}. 
. 
. order Cause Canada_Value Canada_Lower_UL Canada_Upper_UL ///
> United_States_Value United_States_Lower_UL United_States_Upper_UL ///
> Western_Europe_Value Western_Europe_Lower_UL Western_Europe_Upper_UL ///
> Australasia_Value Australasia_Lower_UL Australasia_Upper_UL ///
> Asia_Pacific_Value Asia_Pacific_Lower_UL Asia_Pacific_Upper_UL ///
> Southern_Latin_Value Southern_Latin_Lower_UL Southern_Latin_Upper_UL 
{txt}
{com}. 
. drop cause_id_new
{txt}
{com}. 
. gsort -Canada_Value
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 3.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 3.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 3.dta{rm}
saved
{p_end}

{com}. 
. export excel using "Table 3.xlsx", replace firstrow(varlabels) keepcellfmt
{res}{txt}file {bf:Table 3.xlsx} saved

{com}. 
. 
. /* "Table 3.dta" contents
> 
> % change values 1990-2019
> 
> DALYs comparator country groups
> 
> Both sexes      
> 
> level 2 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 3.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Oct 2023, 20:40:11
{txt}{.-}
{smcl}
{txt}{sf}{ul off}