{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3 d.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 09:15:52
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 3 d.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 3, Life expectancy
. * Table 3: Canada’s rank in the world for 5 health indicators (age-standardized rates) 
. * from 1990 to 2019, by sex and age
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 3 Part 7: YLDs, Life expectancy
. * Input data: "IHME-GBD_2019_DATA-47.csv"
. * Output data: "Table 3 Part7.dta"
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part7
. 
. * Table 3: Canada’s rank in the world for 5 health indicators (age-standardized rates) 
. * from 1990 to 2019, by sex and age
. 
. * DALYS 1990    2000    2010    2019
. 
. * Life expectancy
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-47.csv", clear 
{res}{text}(14 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-47.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/4c375987a7c0058913173149e7847518
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: All Cause Mortality
> Age: <1 year
> Metric: Years
> 
> Measure: Life Expectancy
> Sex: Male, Female, Both
> Cause: (Not applicable)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. 
.         
. rename year Year 
{res}{txt}
{com}. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-47.dta", replace
{txt}file IHME-GBD_2019_DATA-47.dta saved

{com}.         
. 
. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. 
. replace Value = round(Value,0.1)
{txt}(12 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(12 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(12 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. *
. 
. drop location_name 
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Sex Age) j(Year)
{txt}(note: j = 1990 2000 2010 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      12   {txt}->{res}       3
{txt}Number of variables            {res}       6   {txt}->{res}       8
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. order Measure 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 3 Part7.dta", replace
{txt}(note: file Table 3 Part7.dta not found)
file Table 3 Part7.dta saved

{com}. 
. 
. /* "Table 3 Part7.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> Life expectancy 
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 3 d.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3 d.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 09:15:52
{txt}{.-}
{smcl}
{txt}{sf}{ul off}