{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 d.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Apr 2022, 07:52:28
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 4 d.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 4
. * Table 4: Relative (%) changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019 among all high-income countries. 
. 
. * level 2 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate in each of 5 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 4 Part 3: Level 2 Grouping of Conditions, % change in values 1990-2019
. * Input data: "IHME-GBD_2019_DATA-54.csv"
. * Output data: "Table 4 Part4.dta"
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part4
. 
. ** Prepares Table 4, Level 2 Grouping of Conditions
. * Table 4: Relative (%) changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019 among all high-income countries. 
. 
. * level 2 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate in each of 6 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific, Southern Latin America
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-54.csv", clear 
{res}{text}(16 vars, 1,296 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-54.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/340b3f095e419b5ec2b40dc0d44d98e2
> 
> Data settings:
> 
> Base: Single
> Location: 36 countries (See "do Table 4 a.do")
> Year: 1990, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: DALYs
> Sex: Male, Female, Both
> Cause: level 2
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> 
> * Countries in Table 4:
> 
> see "do Table 4 a.do"
> 
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. replace Cause = "Maternal & neonatal" if Cause == "Maternal and neonatal disorders"
{txt}(72 real changes made)

{com}. replace Cause = "Respiratory infections" if Cause == "Respiratory infections and tuberculosis"
{txt}(72 real changes made)

{com}. replace Cause = "Neoplasms" if Cause == "Neoplasms"
{txt}(0 real changes made)

{com}. replace Cause = "Cardiovascular" if Cause == "Cardiovascular diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Chronic respiratory" if Cause == "Chronic respiratory diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Digestive" if Cause == "Digestive diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Neurological" if Cause == "Neurological disorders"
{txt}(72 real changes made)

{com}. replace Cause = "Mental" if Cause == "Mental disorders"
{txt}(72 real changes made)

{com}. replace Cause = "Substance use" if Cause == "Substance use disorders"
{txt}(72 real changes made)

{com}. replace Cause = "Diabetes & kidney" if Cause == "Diabetes and kidney diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Skin" if Cause == "Skin and subcutaneous diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Sense organ" if Cause == "Sense organ diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Musculoskeletal" if Cause == "Musculoskeletal disorders"
{txt}(72 real changes made)

{com}. replace Cause = "Other NCD" if Cause == "Other non-communicable diseases"
{txt}(72 real changes made)

{com}. replace Cause = "Transport injuries" if Cause == "Transport injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Unintentional injuries" if Cause == "Unintentional injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Self-harm and violence" if Cause == "Self-harm and interpersonal violence"
{txt}(72 real changes made)

{com}. 
. gen cause_id_new = .
{txt}(1,296 missing values generated)

{com}. replace cause_id_new = 1 if Cause == "Maternal & neonatal"
{txt}(72 real changes made)

{com}. replace cause_id_new = 2 if Cause == "Respiratory infections"
{txt}(72 real changes made)

{com}. replace cause_id_new = 3 if Cause == "Neoplasms"
{txt}(72 real changes made)

{com}. replace cause_id_new = 4 if Cause == "Cardiovascular"
{txt}(72 real changes made)

{com}. replace cause_id_new = 5 if Cause == "Chronic respiratory"
{txt}(72 real changes made)

{com}. replace cause_id_new = 6 if Cause == "Digestive"
{txt}(72 real changes made)

{com}. replace cause_id_new = 7 if Cause == "Neurological"
{txt}(72 real changes made)

{com}. replace cause_id_new = 8 if Cause == "Mental"
{txt}(72 real changes made)

{com}. replace cause_id_new = 9 if Cause == "Substance use"
{txt}(72 real changes made)

{com}. replace cause_id_new = 10 if Cause == "Diabetes & kidney"
{txt}(72 real changes made)

{com}. replace cause_id_new = 11 if Cause == "Skin"
{txt}(72 real changes made)

{com}. replace cause_id_new = 12 if Cause == "Sense organ"
{txt}(72 real changes made)

{com}. replace cause_id_new = 13 if Cause == "Musculoskeletal"
{txt}(72 real changes made)

{com}. replace cause_id_new = 14 if Cause == "Other NCD"
{txt}(72 real changes made)

{com}. replace cause_id_new = 15 if Cause == "Transport injuries"
{txt}(72 real changes made)

{com}. replace cause_id_new = 16 if Cause == "Unintentional injuries"
{txt}(72 real changes made)

{com}. replace cause_id_new = 17 if Cause == "Self-harm and violence"
{txt}(72 real changes made)

{com}. 
. 
. drop if Cause == "Enteric infections"
{txt}(0 observations deleted)

{com}. drop if Cause == "HIV/AIDS and sexually transmitted infections"
{txt}(0 observations deleted)

{com}. drop if Cause == "Neglected tropical diseases and malaria"
{txt}(0 observations deleted)

{com}. drop if Cause == "Nutritional deficiencies"
{txt}(72 observations deleted)

{com}. drop if Cause == "Other infectious diseases"
{txt}(0 observations deleted)

{com}. 
. 
. 
. gen Sex = ""
{txt}(1,224 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(1,224 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(0 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(0 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(1,224 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(1,224 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(0 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(0 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.01)
{txt}(1,208 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(1,223 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(1,223 real changes made)

{com}. format Value Upper_UL Lower_UL %5.2fc
{txt}
{com}.         
. rename year Year
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}.         
. order sex_id cause_id Year, last
{txt}
{com}. 
. order Sex, after(age_name)
{txt}
{com}. 
. rename location_name Location
{res}{txt}
{com}. 
. order Measure age_name, last
{txt}
{com}. 
. sort Location Sex cause_id_new
{txt}
{com}. 
. sort sex_id_new 
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. keep Location Sex Cause Value Year cause_id_new
{txt}
{com}. 
. keep if Sex == "Both sexes"
{txt}(0 observations deleted)

{com}. 
. drop Sex
{txt}
{com}. 
. * 
. 
. bysort Year Cause: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "Canada's rank of mean DALYs within Country-Cause-Year"
{txt}
{com}. 
. sort Year rank
{txt}
{com}. 
. keep if Location == "Canada"
{txt}(1,190 observations deleted)

{com}. 
. sort Year cause_id_new
{txt}
{com}. 
. drop Location Value
{txt}
{com}. 
. reshape wide rank, i(Cause) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      34   {txt}->{res}      17
{txt}Number of variables            {res}       4   {txt}->{res}       4
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2019
{txt}{hline 77}

{com}. 
. sort cause_id_new
{txt}
{com}. 
. rename rank1990 Rank_in_1990
{res}{txt}
{com}. rename rank2019 Rank_in_2019
{res}{txt}
{com}. 
. label var Rank_in_1990 "Rank in 1990"
{txt}
{com}. label var Rank_in_2019 "Rank in 2019"
{txt}
{com}. 
. drop cause_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part4.dta", replace
{txt}(note: file Table 4 Part4.dta not found)
file Table 4 Part4.dta saved

{com}. 
. 
. /* "Table 4 Part4.dta" contents
> 
> % change values 1990-2019
> 
> DALYs comparator country groups
> 
> Both sexes      
> 
> level 2 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************************************************
. 
. * merge Table 4 Part1 and Part2, (% change in values 1990-2019) and (Canada's Rank in 1990 and Rank in 2019)
. * Level 1 Grouping of Conditions
. 
. use "Table 4 Part1.dta", clear
{txt}
{com}. 
. merge m:m Cause using "Table 4 Part2.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}               3{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. sort cause_id_new
{txt}
{com}. 
. drop cause_id_new
{txt}
{com}. 
. save "Table 4 Part1andPart2.dta", replace
{txt}(note: file Table 4 Part1andPart2.dta not found)
file Table 4 Part1andPart2.dta saved

{com}. 
. 
. 
. * merge Table 4 Part3 and Part4, (% change in values 1990-2019) and (Canada's Rank in 1990 and Rank in 2019)
. * level 2 causes
. 
. use "Table 4 Part3.dta", clear
{txt}
{com}. 
. merge m:m Cause using "Table 4 Part4.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              17{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop location_id_newAsia_Pacific location_id_newAustralasia location_id_newCanada ///
> location_id_newUnited_States location_id_newWestern_Europe 
{txt}
{com}. 
. save "Table 4 Part3andPart4.dta", replace
{txt}(note: file Table 4 Part3andPart4.dta not found)
file Table 4 Part3andPart4.dta saved

{com}. 
. 
. 
. 
. 
. * append level 1 and level 2 causes 
. 
. use "Table 4 Part1andPart2.dta", clear 
{txt}
{com}. 
. append using "Table 4 Part3andPart4.dta"
{txt}{p 0 7 2}
(note: variable
Cause was 
str16, now str22 to accommodate using data's values)
{p_end}

{com}. 
. replace cause_id_new = cause_id_new + 3
{txt}(17 real changes made)

{com}. 
. replace cause_id_new = 1 in 1 
{txt}(1 real change made)

{com}. replace cause_id_new = 2 in 2
{txt}(1 real change made)

{com}. replace cause_id_new = 3 in 3 
{txt}(1 real change made)

{com}. 
. sort cause_id_new
{txt}
{com}. 
. drop cause_id_new location_id_newSouthern_Latin
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4.dta", replace
{txt}file Table 4.dta saved

{com}. 
. export excel using "Table 4.xlsx", replace firstrow(varlabels)
{res}{txt}file Table 4.xlsx saved

{com}. 
. 
. 
. 
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 4 Part1andPart2.dta"
{txt}

{com}. shell rm -r "Table 4 Part1.dta"
{txt}

{com}. shell rm -r "Table 4 Part2.dta"
{txt}

{com}. shell rm -r "Table 4 Part3.dta"
{txt}

{com}. shell rm -r "Table 4 Part3andPart4.dta"
{txt}

{com}. shell rm -r "Table 4 Part4.dta"
{txt}

{com}. 
. 
. 
. 
. /*
> 
> * restore native scheme (of the local machine)
> 
> set scheme $nativescheme
> 
> di c(scheme)
> 
> */
. 
. 
. 
. **********************
. 
. view "log Table 4 d.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 d.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Apr 2022, 07:52:29
{txt}{.-}
{smcl}
{txt}{sf}{ul off}