{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 5 d.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Apr 2022, 10:18:27
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 5 d.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 5
. * Table 5: Changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019
. 
. * level 2 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate in each of 5 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 5 Part 3: Level 2 Grouping of Conditions, % change in values 1990-2019
. * Input data: "IHME-GBD_2019_DATA-54.csv"
. * Output data: "Table 5 Part4.dta"
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 5 Part4
. 
. ** Prepares Table 5, Level 2 Grouping of Conditions
. * Table 5: Changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019
. 
. * level 2 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate in each of 5 group of countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-54.csv", clear 
{res}{text}(16 vars, 2,816 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-54.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/7df00200646c18ff7d335043fa02efb1
> 
> Data settings:
> 
> Base: Single
> Location: Canada, United States, Western Europe, Australasia, Asia-Pacific (33 countries) See below
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: DALYs
> Sex: Male, Female, Both
> Cause: level 2
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> 
> * Countries in Table 5:
> Canada, United States, Western Europe (26), Australasia (2), Asia-Pacific (4) (33 countries)
> 
> 
> Western Europe:
> 1       Andorra
> 2       Austria
> 3       Belgium
> 4       Cyprus
> 5       Denmark
> 6       Finland
> 7       France
> 8       Germany
> 9       Greece
> 10      Iceland
> 11      Ireland
> 12      Israel
> 13      Italy
> 14      Japan
> 15      Luxembourg
> 16      Malta
> 17      Monaco
> 18      Netherlands
> 19      Norway
> 20      Portugal
> 21      San Marino
> 22      Spain
> 23      Sweden
> 25  Switzerland
> 26      United Kingdom
> 
> Australasia: Australia, New Zealand
> 
> High-income Asia-Pacific:
> 1  Brunei Darussalam
> 2  Japan
> 3  Republic of Korea
> 4  Singapore
> 
> 
> * 33 countries:
> 1       Andorra
> 2       Australia
> 3       Austria
> 4       Belgium
> 5       Brunei Darussalam
> 6       Canada
> 7       Cyprus
> 8       Denmark
> 9       Finland
> 10      France
> 11      Germany
> 12      Greece
> 13      Iceland
> 14      Ireland
> 15      Israel
> 16      Italy
> 17      Japan
> 18      Japan
> 19      Luxembourg
> 20      Malta
> 21      Monaco
> 22      Netherlands
> 23      New Zealand
> 25      Norway
> 25      Portugal
> 26      Republic of Korea
> 27      San Marino
> 28      Singapore
> 29      Spain
> 30      Sweden
> 31      Switzerland
> 32      United Kingdom
> 33      United States of America
> 
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. replace Cause = "Maternal & neonatal" if Cause == "Maternal and neonatal disorders"
{txt}(128 real changes made)

{com}. replace Cause = "Respiratory infections" if Cause == "Respiratory infections and tuberculosis"
{txt}(128 real changes made)

{com}. replace Cause = "Neoplasms" if Cause == "Neoplasms"
{txt}(0 real changes made)

{com}. replace Cause = "Cardiovascular" if Cause == "Cardiovascular diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Chronic respiratory" if Cause == "Chronic respiratory diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Digestive" if Cause == "Digestive diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Neurological" if Cause == "Neurological disorders"
{txt}(128 real changes made)

{com}. replace Cause = "Mental" if Cause == "Mental disorders"
{txt}(128 real changes made)

{com}. replace Cause = "Substance use" if Cause == "Substance use disorders"
{txt}(128 real changes made)

{com}. replace Cause = "Diabetes & kidney" if Cause == "book"
{txt}(0 real changes made)

{com}. replace Cause = "Skin" if Cause == "Skin and subcutaneous diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Sense organ" if Cause == "Sense organ diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Musculoskeletal" if Cause == "Musculoskeletal disorders"
{txt}(128 real changes made)

{com}. replace Cause = "Other NCD" if Cause == "Other non-communicable diseases"
{txt}(128 real changes made)

{com}. replace Cause = "Transport injuries" if Cause == "Transport injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Unintentional injuries" if Cause == "Unintentional injuries"
{txt}(0 real changes made)

{com}. replace Cause = "Self-harm and violence" if Cause == "Self-harm and interpersonal violence"
{txt}(128 real changes made)

{com}. 
. gen cause_id_new = .
{txt}(2,816 missing values generated)

{com}. replace cause_id_new = 1 if Cause == "Maternal & neonatal"
{txt}(128 real changes made)

{com}. replace cause_id_new = 2 if Cause == "Respiratory infections"
{txt}(128 real changes made)

{com}. replace cause_id_new = 3 if Cause == "Neoplasms"
{txt}(128 real changes made)

{com}. replace cause_id_new = 4 if Cause == "Cardiovascular"
{txt}(128 real changes made)

{com}. replace cause_id_new = 5 if Cause == "Chronic respiratory"
{txt}(128 real changes made)

{com}. replace cause_id_new = 6 if Cause == "Digestive"
{txt}(128 real changes made)

{com}. replace cause_id_new = 7 if Cause == "Neurological"
{txt}(128 real changes made)

{com}. replace cause_id_new = 8 if Cause == "Mental"
{txt}(128 real changes made)

{com}. replace cause_id_new = 9 if Cause == "Substance use"
{txt}(128 real changes made)

{com}. replace cause_id_new = 10 if Cause == "Diabetes & kidney"
{txt}(0 real changes made)

{com}. replace cause_id_new = 11 if Cause == "Skin"
{txt}(128 real changes made)

{com}. replace cause_id_new = 12 if Cause == "Sense organ"
{txt}(128 real changes made)

{com}. replace cause_id_new = 13 if Cause == "Musculoskeletal"
{txt}(128 real changes made)

{com}. replace cause_id_new = 14 if Cause == "Other NCD"
{txt}(128 real changes made)

{com}. replace cause_id_new = 15 if Cause == "Transport injuries"
{txt}(128 real changes made)

{com}. replace cause_id_new = 16 if Cause == "Unintentional injuries"
{txt}(128 real changes made)

{com}. replace cause_id_new = 17 if Cause == "Self-harm and violence"
{txt}(128 real changes made)

{com}. 
. 
. 
. drop if Cause == "Enteric infections"
{txt}(128 observations deleted)

{com}. drop if Cause == "HIV/AIDS and sexually transmitted infections"
{txt}(128 observations deleted)

{com}. drop if Cause == "Neglected tropical diseases and malaria"
{txt}(128 observations deleted)

{com}. drop if Cause == "Nutritional deficiencies"
{txt}(128 observations deleted)

{com}. drop if Cause == "Other infectious diseases"
{txt}(128 observations deleted)

{com}. 
. 
. 
. 
. gen Sex = ""
{txt}(2,176 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(2,176 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(0 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(0 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,176 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(2,176 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(0 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(0 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.01)
{txt}(2,145 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,173 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,174 real changes made)

{com}. format Value Upper_UL Lower_UL %5.2fc
{txt}
{com}.         
. rename year Year
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(1,088 observations deleted)

{com}.         
. order sex_id cause_id Year, last
{txt}
{com}. 
. order Sex, after(age_name)
{txt}
{com}. 
. rename location_name Location
{res}{txt}
{com}. 
. order Measure age_name, last
{txt}
{com}. 
. sort Location Sex cause_id_new
{txt}
{com}. 
. sort sex_id_new 
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. keep Location Sex Cause Value Year cause_id_new
{txt}
{com}. 
. keep if Sex == "Both sexes"
{txt}(0 observations deleted)

{com}. 
. drop Sex
{txt}
{com}. 
. * 
. 
. bysort Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Year"
{txt}
{com}. 
. sort Year rank
{txt}
{com}. 
. keep if Location == "Canada"
{txt}(1,054 observations deleted)

{com}. 
. sort Year cause_id_new
{txt}
{com}. 
. drop cause_id_new Location Value
{txt}
{com}. 
. reshape wide rank, i(Cause) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      34   {txt}->{res}      17
{txt}Number of variables            {res}       3   {txt}->{res}       3
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2019
{txt}{hline 77}

{com}. 
. rename rank1990 Rank_in_1990
{res}{txt}
{com}. rename rank2019 Rank_in_2019
{res}{txt}
{com}. 
. label var Rank_in_1990 "Rank in 1990"
{txt}
{com}. label var Rank_in_2019 "Rank in 2019"
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 5 Part4.dta", replace
{txt}(note: file Table 5 Part4.dta not found)
file Table 5 Part4.dta saved

{com}. 
. 
. /* "Table 5 Part4.dta" contents
> 
> % change values 1990-2019
> 
> DALYs comparator country groups
> 
> Both sexes      
> 
> level 2 causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************************************************
. 
. * merge Table 5 Part1 and Part2, (% change in values 1990-2019) and (Canada's Rank in 1990 and Rank in 2019)
. * Level 1 Grouping of Conditions
. 
. use "Table 5 Part1.dta", clear
{txt}
{com}. 
. merge m:m Cause using "Table 5 Part2.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}               4{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. save "Table 5 Part1andPart2.dta", replace
{txt}(note: file Table 5 Part1andPart2.dta not found)
file Table 5 Part1andPart2.dta saved

{com}. 
. 
. 
. * merge Table 5 Part3 and Part4, (% change in values 1990-2019) and (Canada's Rank in 1990 and Rank in 2019)
. * level 2 causes
. 
. use "Table 5 Part3.dta", clear
{txt}
{com}. 
. merge m:m Cause using "Table 5 Part4.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              17{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. save "Table 5 Part3andPart4.dta", replace
{txt}(note: file Table 5 Part3andPart4.dta not found)
file Table 5 Part3andPart4.dta saved

{com}. 
. 
. 
. 
. 
. * append level 1 and level 2 causes 
. 
. use "Table 5 Part1andPart2.dta", clear 
{txt}
{com}. 
. append using "Table 5 Part3andPart4.dta"
{txt}{p 0 7 2}
(note: variable
Cause was 
str10, now str28 to accommodate using data's values)
{p_end}

{com}. 
. qui compress
{txt}
{com}. 
. save "Table 5.dta", replace
{txt}(note: file Table 5.dta not found)
file Table 5.dta saved

{com}. 
. export excel using "Table 5.xlsx", replace firstrow(varlabels)
{res}{txt}file Table 5.xlsx saved

{com}. 
. 
. 
. 
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 5 Part1andPart2.dta"
{txt}

{com}. shell rm -r "Table 5 Part1.dta"
{txt}

{com}. shell rm -r "Table 5 Part2.dta"
{txt}

{com}. shell rm -r "Table 5 Part3.dta"
{txt}

{com}. shell rm -r "Table 5 Part3andPart4.dta"
{txt}

{com}. shell rm -r "Table 5 Part4.dta"
{txt}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 5 d.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 5 d.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Apr 2022, 10:18:28
{txt}{.-}
{smcl}
{txt}{sf}{ul off}