{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Apr 2022, 16:29:30
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 3.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. ** Prepares Table 3
. * Table 3: Top 10 level 3 causes of DALYs, YLDs and YLLs in 1990 and 2019 by sex, 
. * all ages and age-standardized.
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 3 Part 1: DALYs, 1990
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part1.dta"
. 
. ** Table 3 Part 2: DALYs, 2019
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part2.dta"
. 
. ** Table 3 Part 3: YLLs, 1990
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part3.dta"
. 
. ** Table 3 Part 4: YLLs, 2019
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part4.dta"
. 
. ** Table 3 Part 5: YLDs, 1990
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part5.dta"
. 
. ** Table 3 Part 6: YLDs, 2019
. * Input data: "IHME-GBD_2019_DATA-31.csv"
. * Output data: "Table 3 Part6.dta"
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part1
. 
. * Top 10 level 3 causes of DALYs in 1990 and 2019 by sex, All ages and Age-Standardized 
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-31.csv", clear 
{res}{text}(16 vars, 11,152 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-31.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/58b240731c27fc1c0d876614e96818d9
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: All Ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: level 3 causes (169 causes)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. drop measure_id location_id location_name age_id metric_id metric_name
{txt}
{com}. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(4,040 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(3,976 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(3,136 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(11,152 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(4,040 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(3,136 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(3,976 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(11,152 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(5,584 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(5,568 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(11,152 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(3,752 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(3,676 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(3,724 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(11,152 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(3,752 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(3,676 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(3,724 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(10,038 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(10,038 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(10,030 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort measure_id sex_id_new age_id_new Year cause_id
{txt}
{com}. 
. 
. order Sex, after(Age)
{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}. 
. * gen Sex-Year-Age combinations
. 
. egen Sex_Year_Age = group(Sex Year Age), lname(name)
{txt}
{com}. 
. label var Sex_Year_Age "Sex-Year-Age group"
{txt}
{com}. 
. order cause_id, last
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31.dta", replace
{txt}file IHME-GBD_2019_DATA-31.dta saved

{com}. 
. 
.         
. keep if Measure == "DALYs"
{txt}(3,556 observations deleted)

{com}. 
. bysort Sex_Year_Age: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year-Age group"
{txt}
{com}. 
. sort Sex_Year_Age rank
{txt}
{com}. 
. drop if Sex == "Both sexes"
{txt}(676 observations deleted)

{com}. 
. drop Value Lower_UL Upper_UL measure_id_new cause_id
{txt}
{com}. 
. order Measure Age Sex Year rank Cause
{txt}
{com}. 
. sort age_id_new sex_id_new Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(1,264 observations deleted)

{com}. 
. drop Sex_Year_Age 
{txt}
{com}. 
. drop sex_id
{txt}
{com}. 
. *
. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 DALYs.dta", replace 
{txt}file IHME-GBD_2019_DATA-31 DALYs.dta saved

{com}. 
. 
. * DALYs 1990
. 
. use "IHME-GBD_2019_DATA-31 DALYs.dta", clear 
{txt}
{com}. 
. keep if Year == 1990
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank1990
{res}{txt}
{com}. rename Cause Cause1990
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 DALYs 1990.dta", replace
{txt}file IHME-GBD_2019_DATA-31 DALYs 1990.dta saved

{com}. 
. 
. * DALYs 2019
. 
. use "IHME-GBD_2019_DATA-31 DALYs.dta", clear 
{txt}
{com}. 
. keep if Year == 2019
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank2019
{res}{txt}
{com}. rename Cause Cause2019
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 DALYs 2019.dta", replace
{txt}file IHME-GBD_2019_DATA-31 DALYs 2019.dta saved

{com}. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part2
. 
. * Top 10 level 3 causes of YLLs in 1990 and 2019 by sex, All ages and Age-Standardized 
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-31.csv", clear 
{res}{text}(16 vars, 11,152 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-31.csv" Metadata:
> 
> See Metadata above
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. drop measure_id location_id location_name age_id metric_id metric_name
{txt}
{com}. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(4,040 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(3,976 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(3,136 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(11,152 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(4,040 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(3,136 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(3,976 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(11,152 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(5,584 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(5,568 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(11,152 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(3,752 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(3,676 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(3,724 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(11,152 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(3,752 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(3,676 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(3,724 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(10,038 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(10,038 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(10,030 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort measure_id sex_id_new age_id_new Year cause_id
{txt}
{com}. 
. 
. order Sex, after(Age)
{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}. 
. * gen Sex-Year-Age combinations
. 
. egen Sex_Year_Age = group(Sex Year Age), lname(name)
{txt}
{com}. 
. label var Sex_Year_Age "Sex-Year-Age group"
{txt}
{com}. 
. order cause_id, last
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31.dta", replace
{txt}file IHME-GBD_2019_DATA-31.dta saved

{com}. 
. 
. 
. keep if Measure == "YLLs"
{txt}(4,008 observations deleted)

{com}. 
. bysort Sex_Year_Age: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLLs within Sex-Year-Age group"
{txt}
{com}. 
. sort Sex_Year_Age rank
{txt}
{com}. 
. drop if Sex == "Both sexes"
{txt}(532 observations deleted)

{com}. 
. drop Value Lower_UL Upper_UL measure_id_new cause_id
{txt}
{com}. 
. order Measure Age Sex Year rank Cause
{txt}
{com}. 
. sort age_id_new sex_id_new Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(956 observations deleted)

{com}. 
. drop Sex_Year_Age 
{txt}
{com}. 
. drop sex_id
{txt}
{com}. 
. *
. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLLs.dta", replace 
{txt}file IHME-GBD_2019_DATA-31 YLLs.dta saved

{com}. 
. 
. * YLLs 1990
. 
. use "IHME-GBD_2019_DATA-31 YLLs.dta", clear 
{txt}
{com}. 
. keep if Year == 1990
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank1990
{res}{txt}
{com}. rename Cause Cause1990
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLLs 1990.dta", replace
{txt}file IHME-GBD_2019_DATA-31 YLLs 1990.dta saved

{com}. 
. 
. * YLLs 2019
. 
. use "IHME-GBD_2019_DATA-31 YLLs.dta", clear 
{txt}
{com}. 
. keep if Year == 2019
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank2019
{res}{txt}
{com}. rename Cause Cause2019
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLLs 2019.dta", replace
{txt}file IHME-GBD_2019_DATA-31 YLLs 2019.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 3 Part2
. 
. * Top 10 level 3 causes of YLDs in 1990 and 2019 by sex, All ages and Age-Standardized 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-31.csv", clear 
{res}{text}(16 vars, 11,152 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-31.csv" Metadata:
> 
> See Metadata above
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. drop measure_id location_id location_name age_id metric_id metric_name
{txt}
{com}. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(4,040 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(3,976 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(3,136 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(11,152 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(4,040 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(3,136 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(3,976 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(11,152 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(5,584 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(5,568 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(11,152 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(3,752 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(3,676 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(3,724 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(11,152 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(3,752 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(3,676 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(3,724 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(10,038 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(10,038 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(10,030 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort measure_id sex_id_new age_id_new Year cause_id
{txt}
{com}. 
. 
. order Sex, after(Age)
{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(5,576 observations deleted)

{com}. 
. * gen Sex-Year-Age combinations
. 
. egen Sex_Year_Age = group(Sex Year Age), lname(name)
{txt}
{com}. 
. label var Sex_Year_Age "Sex-Year-Age group"
{txt}
{com}. 
. order cause_id, last
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31.dta", replace
{txt}file IHME-GBD_2019_DATA-31.dta saved

{com}. 
. 
. 
. keep if Measure == "YLDs"
{txt}(3,588 observations deleted)

{com}. 
. bysort Sex_Year_Age: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year-Age group"
{txt}
{com}. 
. sort Sex_Year_Age rank
{txt}
{com}. 
. drop if Sex == "Both sexes"
{txt}(668 observations deleted)

{com}. 
. drop Value Lower_UL Upper_UL measure_id_new cause_id
{txt}
{com}. 
. order Measure Age Sex Year rank Cause
{txt}
{com}. 
. sort age_id_new sex_id_new Year rank
{txt}
{com}. 
. keep if rank <= 10
{txt}(1,240 observations deleted)

{com}. 
. drop Sex_Year_Age 
{txt}
{com}. 
. drop sex_id
{txt}
{com}. 
. *
. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLDs.dta", replace 
{txt}file IHME-GBD_2019_DATA-31 YLDs.dta saved

{com}. 
. 
. * YLDs 1990
. 
. use "IHME-GBD_2019_DATA-31 YLDs.dta", clear 
{txt}
{com}. 
. keep if Year == 1990
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank1990
{res}{txt}
{com}. rename Cause Cause1990
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLDs 1990.dta", replace
{txt}file IHME-GBD_2019_DATA-31 YLDs 1990.dta saved

{com}. 
. 
. * YLDs 2019
. 
. use "IHME-GBD_2019_DATA-31 YLDs.dta", clear 
{txt}
{com}. 
. keep if Year == 2019
{txt}(40 observations deleted)

{com}. 
. sort age_id_new sex_id_new
{txt}
{com}. 
. rename rank Rank2019
{res}{txt}
{com}. rename Cause Cause2019
{res}{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-31 YLDs 2019.dta", replace
{txt}file IHME-GBD_2019_DATA-31 YLDs 2019.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *************************************************************************
. 
. * merge DALYs 1990 and DALYs 2019 
. 
. use "IHME-GBD_2019_DATA-31 DALYs 1990.dta", clear
{txt}
{com}. 
. merge m:m row using "IHME-GBD_2019_DATA-31 DALYs 2019.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              40{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. order Measure
{txt}
{com}. 
. order row, last
{txt}
{com}. 
. order Rank1990, before(Cause1990)
{txt}
{com}. order Rank2019, before(Cause2019)
{txt}
{com}. 
. rename Cause1990 DALYsCause1990
{res}{txt}
{com}. rename Cause2019 DALYsCause2019
{res}{txt}
{com}. 
. drop Year
{txt}
{com}. 
. order age_id_new sex_id_new, last
{txt}
{com}. 
. save "Table 3 DALYs.dta", replace
{txt}(note: file Table 3 DALYs.dta not found)
file Table 3 DALYs.dta saved

{com}. 
. 
. 
. 
. 
. 
. *************************************************************************
. 
. * merge YLLs 1990 and YLLs 2019 
. 
. use "IHME-GBD_2019_DATA-31 YLLs 1990.dta", clear
{txt}
{com}. 
. merge m:m row using "IHME-GBD_2019_DATA-31 YLLs 2019.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              40{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. order Measure
{txt}
{com}. 
. order row, last
{txt}
{com}. 
. order Rank1990, before(Cause1990)
{txt}
{com}. order Rank2019, before(Cause2019)
{txt}
{com}. 
. rename Cause1990 YLLsCause1990
{res}{txt}
{com}. rename Cause2019 YLLsCause2019
{res}{txt}
{com}. 
. drop Year
{txt}
{com}. 
. order age_id_new sex_id_new, last
{txt}
{com}. 
. save "Table 3 YLLs.dta", replace
{txt}(note: file Table 3 YLLs.dta not found)
file Table 3 YLLs.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. *************************************************************************
. 
. * merge YLDs 1990 and YLDs 2019 
. 
. use "IHME-GBD_2019_DATA-31 YLDs 1990.dta", clear
{txt}
{com}. 
. merge m:m row using "IHME-GBD_2019_DATA-31 YLDs 2019.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              40{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. order Measure
{txt}
{com}. 
. order row, last
{txt}
{com}. 
. order Rank1990, before(Cause1990)
{txt}
{com}. order Rank2019, before(Cause2019)
{txt}
{com}. 
. rename Cause1990 YLDsCause1990
{res}{txt}
{com}. rename Cause2019 YLDsCause2019
{res}{txt}
{com}. 
. drop Year
{txt}
{com}. 
. order age_id_new sex_id_new, last
{txt}
{com}. 
. save "Table 3 YLDs.dta", replace
{txt}(note: file Table 3 YLDs.dta not found)
file Table 3 YLDs.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *************************************************************************
. 
. * append DALYs, YLLs, and YLDs 
. 
. use "Table 3 DALYs.dta", clear
{txt}
{com}. 
. merge m:m row using "Table 3 YLLs.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              40{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. rename Rank1990 Rank
{res}{txt}
{com}. 
. drop Rank2019
{txt}
{com}. 
. drop Measure
{txt}
{com}. 
. merge m:m row using "Table 3 YLDs.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              40{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop Rank1990 Rank2019 row Measure age_id_new   sex_id_new
{txt}
{com}. 
. 
. 
. 
. foreach var in DALYsCause1990 DALYsCause2019 YLLsCause1990 YLLsCause2019 YLDsCause1990 YLDsCause2019 {c -(}
{txt}  2{com}.         qui {c -(}
{txt}  3{com}. replace `var' = "Alzheimer’s" if `var' == "Alzheimer's disease and other dementias"
{txt}  4{com}. replace `var' = "Anxiety" if `var' == "Anxiety disorders"
{txt}  5{com}. replace `var' = "Breast cancer" if `var' == "Breast cancer"
{txt}  6{com}. replace `var' = "COPD" if `var' == "Chronic obstructive pulmonary disease"
{txt}  7{com}. replace `var' = "Cirrhosis" if `var' == "Cirrhosis and other chronic liver diseases"
{txt}  8{com}. replace `var' = "Colorectal Ca" if `var' == "Colon and rectum cancer"
{txt}  9{com}. replace `var' = "Congenital" if `var' == "Congenital birth defects"
{txt} 10{com}. replace `var' = "Depression" if `var' == "Depressive disorders"
{txt} 11{com}. replace `var' = "Diabetes" if `var' == "Diabetes mellitus"
{txt} 12{com}. replace `var' = "Drug use" if `var' == "Drug use disorders"
{txt} 13{com}. replace `var' = "Falls" if `var' == "Falls"
{txt} 14{com}. replace `var' = "Gynecological" if `var' == "Gynecological diseases"
{txt} 15{com}. replace `var' = "Headaches" if `var' == "Headache disorders"
{txt} 16{com}. replace `var' = "Hearing loss" if `var' == "Age-related and other hearing loss"
{txt} 17{com}. replace `var' = "IHD" if `var' == "Ischemic heart disease"
{txt} 18{com}. replace `var' = "LBP" if `var' == "Low back pain"
{txt} 19{com}. replace `var' = "LRI" if `var' == "Lower respiratory infections"
{txt} 20{com}. replace `var' = "Lung cancer" if `var' == "Tracheal, bronchus, and lung cancer"
{txt} 21{com}. replace `var' = "Neck pain" if `var' == "Neck pain"
{txt} 22{com}. replace `var' = "Neonatal" if `var' == "Neonatal disorders"
{txt} 23{com}. replace `var' = "Neonatal dis" if `var' == "Neonatal disorders"
{txt} 24{com}. replace `var' = "Oral disorders" if `var' == "Oral disorders"
{txt} 25{com}. replace `var' = "Osteoarthritis" if `var' == "Osteoarthritis"
{txt} 26{com}. replace `var' = "Other MSK" if `var' == "Other musculoskeletal disorders"
{txt} 27{com}. replace `var' = "Pancreatic Ca" if `var' == "Pancreatic cancer"
{txt} 28{com}. replace `var' = "Prostate Ca" if `var' == "Prostate cancer"
{txt} 29{com}. replace `var' = "Road injuries" if `var' == "Road injuries"
{txt} 30{com}. replace `var' = "Self-harm" if `var' == "Self-harm"
{txt} 31{com}. replace `var' = "Stroke" if `var' == "Stroke"
{txt} 32{com}.         {c )-}
{txt} 33{com}. {c )-}
{txt}
{com}. *
. 
. qui compress
{txt}
{com}. 
. 
. save "Table 3.dta", replace
{txt}file Table 3.dta saved

{com}. 
. export excel using "Table 3.xlsx", replace firstrow(varlabels)
{res}{txt}file Table 3.xlsx saved

{com}. 
. 
. 
. 
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 3 DALYs.dta"
{txt}

{com}. shell rm -r "Table 3 YLDs.dta"
{txt}

{com}. shell rm -r "Table 3 YLLs.dta"
{txt}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 3.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Apr 2022, 16:29:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}