{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Oct 2023, 20:40:11
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 4.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. ** Prepares Table 4
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 4 Part 1: DALYs, Age-standardized
. * Input data: "IHME-GBD_2019_DATA-41.csv"
. * Output data: "Table 4 Part1.dta"
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part1, DALYS
. 
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. * DALYS 1990    2000    2010    2019
. 
. * (age-standardized rates)
. *    Both       
. *    Male       
. *    Female     
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-41.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(16 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-41.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/e5609fd1e940e488c706d26f04c53112
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: DALYs
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(2,448 real changes made)

{com}. qui compress
{txt}
{com}. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(2,345 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,354 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,362 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id cause_id
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{res}{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-41.dta", replace
{txt}{p 0 4 2}
(file {bf}
IHME-GBD_2019_DATA-41.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IHME-GBD_2019_DATA-41.dta{rm}
saved
{p_end}

{com}. 
. 
. * for DALYs 1990 2000 2010 2019 Age-standardized
.         
. keep if Measure == "DALYs"
{txt}(0 observations deleted)

{com}. 
. bysort Sex_Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name Cause
{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Measure Sex Age) j(Year)
{txt}(j = 1990 2000 2010 2019)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}          12   {txt}->   {res}3           
{txt}Number of variables        {res}           6   {txt}->   {res}8           
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part1.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4 Part1.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4 Part1.dta{rm}
saved
{p_end}

{com}. 
. 
. /* "Table 4 Part1.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> All causes
> 
> */
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part2, YLLs
. 
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-43.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(16 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-43.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/e3d46c870342223239f833088ed4ba10
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: YLLs
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(2,448 real changes made)

{com}. qui compress
{txt}
{com}. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(2,373 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,380 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,383 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id cause_id
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{res}{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-43.dta", replace
{txt}{p 0 4 2}
(file {bf}
IHME-GBD_2019_DATA-43.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IHME-GBD_2019_DATA-43.dta{rm}
saved
{p_end}

{com}. 
. 
. * for YLLs 1990 2000 2010 2019 All Ages
.         
. keep if Measure == "YLLs"
{txt}(0 observations deleted)

{com}. 
. 
. bysort Sex_Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean YLLs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name Cause
{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Measure Sex Age) j(Year)
{txt}(j = 1990 2000 2010 2019)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}          12   {txt}->   {res}3           
{txt}Number of variables        {res}           6   {txt}->   {res}8           
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part2.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4 Part2.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4 Part2.dta{rm}
saved
{p_end}

{com}. 
. 
. /* "Table 4 Part2.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> YLLs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> All causes
> 
> */
. 
. 
. 
. 
.  
.  
.  
.  
.  
.  
.  
.  
.  ***********************************************************************
. * Prepare Table 4 Part3, YLDs
. 
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-45.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(16 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-45.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/9768d126557df1e38cde353950498730
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: YLDs
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(2,448 real changes made)

{com}. qui compress
{txt}
{com}. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(2,418 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,428 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,432 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id cause_id
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{res}{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-45.dta", replace
{txt}{p 0 4 2}
(file {bf}
IHME-GBD_2019_DATA-45.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IHME-GBD_2019_DATA-45.dta{rm}
saved
{p_end}

{com}. 
. 
. * for YLDs 1990 2000 2010 2019 All Ages
.         
. keep if Measure == "YLDs"
{txt}(0 observations deleted)

{com}. 
. 
. bysort Sex_Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name Cause
{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Measure Sex Age) j(Year)
{txt}(j = 1990 2000 2010 2019)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}          12   {txt}->   {res}3           
{txt}Number of variables        {res}           6   {txt}->   {res}8           
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part3.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4 Part3.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4 Part3.dta{rm}
saved
{p_end}

{com}. 
. 
. /* "Table 4 Part3.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> YLDs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> All causes
> 
> */
. 
. 
.  
.  
.  
.  
.  
.  
.  
.  
.  
.  
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part4
. 
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. * Life expectancy
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-47.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(14 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-47.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/4c375987a7c0058913173149e7847518
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: All Cause Mortality
> Age: <1 year
> Metric: Years
> 
> Measure: Life Expectancy
> Sex: Male, Female, Both
> Cause: (Not applicable)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. 
.         
. rename year Year 
{res}{txt}
{com}. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{res}{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-47.dta", replace
{txt}{p 0 4 2}
(file {bf}
IHME-GBD_2019_DATA-47.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IHME-GBD_2019_DATA-47.dta{rm}
saved
{p_end}

{com}.         
. 
. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. 
. replace Value = round(Value,0.1)
{txt}(12 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(12 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(12 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. *
. 
. drop location_name 
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Sex Age) j(Year)
{txt}(j = 1990 2000 2010 2019)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}          12   {txt}->   {res}3           
{txt}Number of variables        {res}           6   {txt}->   {res}8           
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. order Measure 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part4.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4 Part4.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4 Part4.dta{rm}
saved
{p_end}

{com}. 
. 
. /* "Table 4 Part4.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> Life expectancy 
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
.  
.  
.  
.  
.  
.  
.  
. 
. ***********************************************************************
. * Prepare Table 4 Part5
. 
. * Table 4: Canada's global rank position for five health indicators, 1990 to 2019 
. 
. * Post Neonatal mortality
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-48.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{res}{text}(16 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-48.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/17aa77d2e7698990f2133ad310976857
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: All Cause Mortality
> Age: <1 year
> Metric: Years
> 
> Measure: Life Expectancy
> Sex: Male, Female, Both
> Cause: (Not applicable)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}{res}Sex{sf}{txt} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.01)
{txt}(2,421 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,443 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,442 real changes made)

{com}. format Value Upper_UL Lower_UL %5.2fc
{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id  
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{res}{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-48.dta", replace
{txt}{p 0 4 2}
(file {bf}
IHME-GBD_2019_DATA-48.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
IHME-GBD_2019_DATA-48.dta{rm}
saved
{p_end}

{com}.         
. 
. 
. bysort Sex_Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean YLDs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name 
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Sex Age) j(Year)
{txt}(j = 1990 2000 2010 2019)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}          12   {txt}->   {res}3           
{txt}Number of variables        {res}           8   {txt}->   {res}10          
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. order Measure 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part5.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4 Part5.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4 Part5.dta{rm}
saved
{p_end}

{com}. 
. 
. /* "Table 4 Part5.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> Life expectancy 
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************
. * Append parts of Table 4
. 
. use "Table 4 Part1.dta", clear // Part1, DALYs, Age-standardized
{txt}
{com}. 
. append using "Table 4 Part2.dta" // Part2, YLLs, Age-standardized
{txt}
{com}. 
. append using "Table 4 Part3.dta" // Part3, YLDs, Age-standardized
{txt}{p 0 7 2}
(variable
{bf:rank2019} was {bf:byte}, now {bf:int} to accommodate using data's values)
{p_end}

{com}. 
. append using "Table 4 Part4.dta" // Part4, Life expectancy, <1 year
{txt}{p 0 7 2}
(variable
{bf:Measure} was {bf:str5}, now {bf:str15} to accommodate using data's values)
{p_end}

{com}. 
. append using "Table 4 Part5.dta" // Part5, Postneonatal mortality, Postneonatal
{txt}
{com}. 
. replace Measure = "Postneonatal mortality" if Measure == "Deaths"
{txt}variable {bf}{res}Measure{sf}{txt} was {bf}{res}str15{sf}{txt} now {bf}{res}str22{sf}
{txt}(3 real changes made)

{com}. 
. drop cause_id cause_name
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4.dta", replace
{txt}{p 0 4 2}
(file {bf}
Table 4.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
Table 4.dta{rm}
saved
{p_end}

{com}. 
. export excel using "Table 4.xlsx", replace firstrow(varlabels) keepcellfmt
{res}{txt}file {bf:Table 4.xlsx} saved

{com}. 
.                         
. 
.                         
.                         
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 4 Part4.dta"
{txt}

{com}. shell rm -r "Table 4 Part1.dta"
{txt}

{com}. shell rm -r "Table 4 Part2.dta"
{txt}

{com}. shell rm -r "Table 4 Part3.dta"
{txt}

{com}. shell rm -r "Table 4 Part5.dta"
{txt}

{com}. 
.                 
.                 
. 
. 
. 
. 
. 
. 
. 
.  
.  
. 
. 
. 
. **********************
. 
. view "log Table 4.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Oct 2023, 20:40:12
{txt}{.-}
{smcl}
{txt}{sf}{ul off}