{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 b.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 1 Apr 2022, 10:18:23
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 4 b.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 4, YLLs
. * Table 4: Canada’s rank in the world for 5 health indicators (age-standardized rates) 
. * from 1990 to 2019, by sex and age
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 4 Part 3: YLLs, Age-standardized
. * Input data: "IHME-GBD_2019_DATA-43.csv"
. * Output data: "Table 4 Part3.dta"
. 
. ** Table 4 Part 4: YLLs, Age: <5, 5-14, 15-49, 50-69, 70+
. * Input data: "IHME-GBD_2019_DATA-44.csv"
. * Output data: ""Table 4 Part4.dta"
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part3
. 
. * Table 4: Canada’s rank in the world for 5 health indicators (age-standardized rates) 
. * from 1990 to 2019, by sex and age
. 
. * DALYS 1990    2000    2010    2019
. 
. * (age-standardized rates)
. *    Both       
. *    Male       
. *    Female     
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-43.csv", clear 
{res}{text}(16 vars, 2,448 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-43.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/e3d46c870342223239f833088ed4ba10
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: YLLs
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(2,448 real changes made)

{com}. qui compress
{txt}
{com}. 
. 
. gen Sex = ""
{txt}(2,448 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(816 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(816 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(816 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(2,448 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(816 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(816 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(816 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(2,373 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(2,380 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(2,383 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id sex_id_new cause_id
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. * gen Sex-Year combinations  
. 
. egen Sex_Year = group(Sex Year), lname(name)
{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-43.dta", replace
{txt}(note: file IHME-GBD_2019_DATA-43.dta not found)
file IHME-GBD_2019_DATA-43.dta saved

{com}. 
. 
. * for YLLs 1990 2000 2010 2019 All Ages
.         
. keep if Measure == "YLLs"
{txt}(0 observations deleted)

{com}. 
. 
. bysort Sex_Year: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean YLLs within Sex-Year group"
{txt}
{com}. 
. sort Sex_Year rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(2,436 observations deleted)

{com}. 
. *
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name Cause
{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Measure Sex Age) j(Year)
{txt}(note: j = 1990 2000 2010 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      12   {txt}->{res}       3
{txt}Number of variables            {res}       5   {txt}->{res}       7
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part3.dta", replace
{txt}(note: file Table 4 Part3.dta not found)
file Table 4 Part3.dta saved

{com}. 
. 
. /* "Table 4 Part3.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> YLLs 
> 
> Both sexes      Males   Females
> 
> Age-standardized        
> 
> All causes
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part4
. 
. * Table 4: Canada’s rank in the world for 5 health indicators (age-standardized rates) 
. * from 1990 to 2019, by sex and age
. 
. * DALYS 1990    2000    2010    2019
. 
. * Age (Both sexes)
. *     <5        
. *     5-14      
. *     15-49     
. *     50-69     
. *     70+       
.  
.  
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-44.csv", clear 
{res}{text}(16 vars, 12,240 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-44.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/bc7221a695d811b6f058c86cbf586362
> 
> Data settings:
> 
> Base: Single
> Location: Countries and territories (204)
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: <5, 5-14, 15-49, 50-69, 70+
> Metric: Rate
> 
> Measure: YLLs
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
.  
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(12,240 real changes made)

{com}. qui compress
{txt}
{com}. 
. 
. gen Sex = ""
{txt}(12,240 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(4,080 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(4,080 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(4,080 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(12,240 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(4,080 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(4,080 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(4,080 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(11,688 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(11,586 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(11,751 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. 
. sort sex_id_new Year 
{txt}
{com}. 
. drop sex_id cause_id
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. 
. gen age_id_new = .
{txt}(12,240 missing values generated)

{com}. replace age_id_new = 1 if Age == "Under 5"
{txt}(2,448 real changes made)

{com}. replace age_id_new = 2 if Age == "5-14 years"
{txt}(2,448 real changes made)

{com}. replace age_id_new = 3 if Age == "15-49 years"
{txt}(2,448 real changes made)

{com}. replace age_id_new = 4 if Age == "50-69 years"
{txt}(2,448 real changes made)

{com}. replace age_id_new = 5 if Age == "70+ years"
{txt}(2,448 real changes made)

{com}. 
. replace Age = "0-5" if Age == "Under 5"
{txt}(2,448 real changes made)

{com}. replace Age = "5-14" if Age == "5-14 years"
{txt}(2,448 real changes made)

{com}. replace Age = "15-49" if Age == "15-49 years"
{txt}(2,448 real changes made)

{com}. replace Age = "50-69" if Age == "50-69 years"
{txt}(2,448 real changes made)

{com}. replace Age = "70+" if Age == "70+ years"
{txt}(2,448 real changes made)

{com}.  
. 
. * gen Sex-Year-Age combinations  
. 
. egen Sex_Year_Age = group(Sex Year Age), lname(name)
{txt}
{com}. 
. label var Sex_Year_Age "Sex-Year-Age group"
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-44.dta", replace
{txt}(note: file IHME-GBD_2019_DATA-44.dta not found)
file IHME-GBD_2019_DATA-44.dta saved

{com}. 
. 
. * for YLLs 1990 2000 2010 2019 All Ages
.         
. keep if Measure == "YLLs"
{txt}(0 observations deleted)

{com}. 
. 
. bysort Sex_Year_Age: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "rank of mean YLLs within Sex_Year_Age group"
{txt}
{com}. 
. sort Sex_Year_Age rank
{txt}
{com}. 
. label var location_name "Country"
{txt}
{com}. 
. keep if location_name == "Canada"
{txt}(12,180 observations deleted)

{com}. 
. * 
. 
. drop Value Lower_UL Upper_UL Sex_Year
{txt}
{com}. 
. drop location_name Cause
{txt}
{com}. 
. order Measure Sex Age rank 
{txt}
{com}. 
. reshape wide rank, i(Measure Sex Age) j(Year)
{txt}(note: j = 1990 2000 2010 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      60   {txt}->{res}      15
{txt}Number of variables            {res}       7   {txt}->{res}       9
{txt}j variable (4 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2000 ... rank2019
{txt}{hline 77}

{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part4.dta", replace
{txt}(note: file Table 4 Part4.dta not found)
file Table 4 Part4.dta saved

{com}. 
. 
. /* "Table 4 Part4.dta" contents
> 
> Base values of 1990 2000 2010 2019
> 
> Value   Lower UL        Upper UL
> 
> YLLs 
> 
> Both sexes      Males   Females
> 
> Age: <5, 5-14, 15-49, 50-69, 70+        
> 
> All causes
> 
> */
. 
.  
.  
.  
.  
.  
.  
.  
.  
.  
.  
.  
.  
.  
. 
. 
. 
. **********************
. 
. view "log Table 4 b.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 b.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 1 Apr 2022, 10:18:24
{txt}{.-}
{smcl}
{txt}{sf}{ul off}