{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 1.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 09:10:29
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 1.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 1
. * Table 1: All-age (crude) and age-standardized summary measures of population health 
. * in Canada for males and females in 1990 and 2019
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 1 Part 1: DALYs YLLs YLDs, base values 1990 and 2019
. * Input data: "IHME-GBD_2019_DATA-1.csv"
. * Output data: "Table 1 Part1.dta"
. 
. ** Table 1 Part 2: DALYs YLLs YLDs, change % from 1990 to 2019
. * Input data: "IHME-GBD_2019_DATA-2.csv"
. * Output data: "Table 1 Part2.dta"
. 
. ** Table 1 Part 3: DALYs YLLs YLDs, change % from 1990 to 2019
. * Input data: "IHME-GBD_2019_DATA-3.csv"
. * Output data: "Table 1 Part3.dta"
. 
. ** Table 1 Part 4: Life expectancy (at birth) % from 1990 to 2019
. * Input data: "IHME-GBD_2019_DATA-3.dta"
. * Output data: "Table 1 Part4.dta"
. 
. ** Table 1 Part 5: Post-neonatal infant mortality rate 1990 2019
. * Input data: "IHME-GBD_2019_DATA-4.csv"
. * Output data: "Table 1 Part5.dta"
. 
. ** Table 1 Part 6: Post-neonatal infant mortality rate % change 1990 to 2019
. * Input data: "IHME-GBD_2019_DATA-4.csv"
. * Output data: "Table 1 Part6.dta"
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 1
. 
. * DALYs YLLs YLDs base values 1990 and 2019
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-1.csv", clear 
{res}{text}(16 vars, 72 obs)

{com}. 
. /* "IHME-GBD_2019_DATA-1.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/47b4b82e1c612fb0cbc5e0f286cb2a1d
> 
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: All-ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. 
. drop measure_id location_id location_name age_id cause_id cause_name metric_id metric_name
{txt}
{com}. 
. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(24 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(24 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(24 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(72 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(24 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(24 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(24 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(72 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(36 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(36 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(72 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(24 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(24 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(24 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(72 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(24 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(24 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(24 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(72 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(70 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(72 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(36 observations deleted)

{com}. 
. order Measure Age Sex Year Value Lower_UL Upper_UL
{txt}
{com}. 
. sort age_id_new sex_id_new Year
{txt}
{com}. 
. reshape wide Value Lower_UL Upper_UL, i(Measure Age     Sex) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      36   {txt}->{res}      18
{txt}Number of variables            {res}      11   {txt}->{res}      13
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}Value1990 Value2019
                               Lower_UL   {txt}->   {res}Lower_UL1990 Lower_UL2019
                               Upper_UL   {txt}->   {res}Upper_UL1990 Upper_UL2019
{txt}{hline 77}

{com}. 
. sort measure_id_new age_id_new sex_id_new
{txt}
{com}. 
. drop sex_id measure_id_new age_id_new sex_id_new
{txt}
{com}. 
. label var Value1990     "1990 Value"
{txt}
{com}. label var Lower_UL1990 "1990 Lower_UL"
{txt}
{com}. label var Upper_UL1990 "1990 Upper_UL"
{txt}
{com}. label var Value2019 "2019 Value"
{txt}
{com}. label var Lower_UL2019 "2019 Lower_UL"
{txt}
{com}. label var Upper_UL2019 "2019 Upper_UL"
{txt}
{com}. 
. 
. save "Table 1 Part1.dta", replace
{txt}(note: file Table 1 Part1.dta not found)
file Table 1 Part1.dta saved

{com}. 
. 
. /* "Table 1 Part1.dta" contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs YLLs YLDs
> 
> Both sexes      Males   Females
> 
> All ages        Age-standardized
> 
> */
.                                 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 2
. 
. * DALYs YLLs YLDs change % from 1990 to 2019
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-2.csv", clear 
{res}{text}(17 vars, 54 obs)

{com}. 
. 
. 
. /* "IHME-GBD_2019_DATA-2.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/abba564428b723f55bc1f4893394ac39
> 
> Data settings:
> 
> Base: Change
> Location: Canada
> Year range: 1990-2010, 1990-2019, 2010-2019
> 
> Context: Cause
> Age: All-ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. 
. drop measure_id location_id location_name age_id cause_id cause_name metric_id metric_name
{txt}
{com}. 
. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(18 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(18 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(18 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(54 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(18 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(18 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(18 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(54 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(27 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(27 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(54 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(18 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(18 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(18 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(54 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(18 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(18 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(18 real changes made)

{com}. 
. rename  val change_proportion_mean
{res}{txt}
{com}. rename upper change_proportion_upper
{res}{txt}
{com}. rename lower change_proportion_lower
{res}{txt}
{com}. 
. gen change_percent_mean = change_proportion_mean * 100
{txt}
{com}. gen change_percent_upper = change_proportion_upper * 100
{txt}
{com}. gen change_percent_lower = change_proportion_lower * 100
{txt}
{com}. 
. drop change_proportion_*
{txt}
{com}. 
. rename change_percent_mean Value
{res}{txt}
{com}. rename change_percent_upper Lower_UL
{res}{txt}
{com}. rename change_percent_lower Upper_UL
{res}{txt}
{com}. 
. label var Value "Relative change (%)"
{txt}
{com}. label var Lower_UL "Relative change (%) Lower UL"
{txt}
{com}. label var Upper_UL "Relative change (%) Upper UL"
{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(54 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(54 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(54 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year_start Year_start    
{res}{txt}
{com}. rename year_end Year_end
{res}{txt}
{com}.   
.   
. sort measure_id_new sex_id_new age_id_new 
{txt}
{com}. 
. drop sex_id     measure_id_new sex_id_new age_id_new
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. drop Lower_UL Upper_UL
{txt}
{com}. 
. order Measure Age Sex Value 
{txt}
{com}. 
. keep if Year_start == 1990 & Year_end == 2019 
{txt}(36 observations deleted)

{com}. 
. save "Table 1 Part2.dta", replace
{txt}(note: file Table 1 Part2.dta not found)
file Table 1 Part2.dta saved

{com}. 
. 
. 
. /* "Table 1 Part2.dta" contents
> 
> Relative change (%) from 1990 to 2019
> 
> Value   (without Lower UL       Upper UL)
> 
> DALYs YLLs YLDs
> 
> Both sexes      Males   Females
> 
> All ages        Age-standardized
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 3
. 
. * Life expectancy (at birth) base values 1990 and 2019
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-3.csv", clear 
{res}{text}(14 vars, 12 obs)

{com}. 
. 
. 
. /* "IHME-GBD_2019_DATA-3.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/788221935a962b8350f191fa1f265340
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: All Cause Mortality
> Age: <1 year
> Metric: Years
> 
> Measure: Life Expectancy
> Sex: Male, Female, Both
> Cause: (Not applicable)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. 
. * save output data in /output/ folder
. 
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. drop measure_id location_id     location_name   sex_id  age_id  metric_id       metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}. replace Age = "At birth"
{txt}variable {bf}Age{sf} was {bf}{res}str7{sf}{txt} now {bf}{res}str8{sf}
{txt}(12 real changes made)

{com}. 
. rename val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(12 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(12 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(12 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. gen sex_id_new = .
{txt}(12 missing values generated)

{com}. replace sex_id_new = 1 if sex_name == "Both"
{txt}(4 real changes made)

{com}. replace sex_id_new = 2 if sex_name == "Male"
{txt}(4 real changes made)

{com}. replace sex_id_new = 3 if sex_name == "Female"
{txt}(4 real changes made)

{com}. 
. rename sex_name Sex
{res}{txt}
{com}. replace Sex = "Both sexes" if Sex == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str10{sf}
{txt}(4 real changes made)

{com}. replace Sex = "Males" if Sex == "Male"
{txt}(4 real changes made)

{com}. replace Sex = "Females" if Sex == "Female"
{txt}(4 real changes made)

{com}. 
. sort sex_id_new  
{txt}
{com}. 
. drop sex_id_new sex_id_new 
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. rename year Year
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(6 observations deleted)

{com}. 
. 
. order Measure Age Sex Year Value Lower_UL Upper_UL
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(6 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(2 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(2 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(2 real changes made)

{com}. 
. sort sex_id_new Year
{txt}
{com}. 
. 
. reshape wide Value Lower_UL Upper_UL, i(Measure Age     Sex) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}       6   {txt}->{res}       3
{txt}Number of variables            {res}       8   {txt}->{res}      10
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}Value1990 Value2019
                               Lower_UL   {txt}->   {res}Lower_UL1990 Lower_UL2019
                               Upper_UL   {txt}->   {res}Upper_UL1990 Upper_UL2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. drop sex_id_new
{txt}
{com}. 
. label var Value1990     "1990 Value"
{txt}
{com}. label var Lower_UL1990 "1990 Lower_UL"
{txt}
{com}. label var Upper_UL1990 "1990 Upper_UL"
{txt}
{com}. label var Value2019 "2019 Value"
{txt}
{com}. label var Lower_UL2019 "2019 Lower_UL"
{txt}
{com}. label var Upper_UL2019 "2019 Upper_UL"
{txt}
{com}. 
. 
. rename (Value1990 Lower_UL1990 Upper_UL1990 Value2019 Lower_UL2019 Upper_UL2019) ///
> (Y_1990_Value Y_1990_Lower_UL Y_1990_Upper_UL Y_2019_Value Y_2019_Lower_UL Y_2019_Upper_UL)
{res}{txt}
{com}. 
. 
. save "Table 1 Part3.dta", replace
{txt}(note: file Table 1 Part3.dta not found)
file Table 1 Part3.dta saved

{com}. 
. 
. /* "Table 1 Part3.dta" contents
> 
> Life expectancy at birth 1990 2010
> 
> Both sexes      Males   Females
> 
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 4
. 
. * Life expectancy (at birth) % from 1990 to 2019
. 
. 
. * use input data from /output/ folder // Note: % change from year to year not working for Life expectancy
. 
. 
. use "Table 1 Part3.dta", clear
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(3 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(1 real change made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(1 real change made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(1 real change made)

{com}. sort sex_id_new 
{txt}
{com}. 
. 
. 
. 
. * gen % Change = - 100 * (Old - New) / Old; 1990 = Old, 2019 = new
. 
. gen ChangeValue1990_2019 = - 100 * (Y_1990_Value - Y_2019_Value) / Y_1990_Value
{txt}
{com}. gen ChangeLower_UL1990_2019 = - 100 * (Y_1990_Lower_UL - Y_2019_Lower_UL) / Y_1990_Lower_UL
{txt}
{com}. gen ChangeUpper_UL1990_2019 = - 100 * (Y_1990_Upper_UL - Y_2019_Upper_UL) / Y_1990_Upper_UL
{txt}
{com}. 
. keep Measure Age Sex ChangeValue1990_2019 ChangeUpper_UL1990_2019 ChangeLower_UL1990_2019 sex_id_new
{txt}
{com}. 
. 
. replace Measure = "Life expectancy % Change 1990 to 2019"
{txt}variable {bf}Measure{sf} was {bf}{res}str15{sf}{txt} now {bf}{res}str37{sf}
{txt}(3 real changes made)

{com}. 
. rename ChangeValue1990_2019 Value
{res}{txt}
{com}. rename ChangeUpper_UL1990_2019 Upper_UL
{res}{txt}
{com}. rename ChangeLower_UL1990_2019 Lower_UL
{res}{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(3 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(3 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(3 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. 
. order Measure Age Sex Value  
{txt}
{com}. 
. drop Lower_UL Upper_UL
{txt}
{com}. 
. 
. * save output data in /output/ folder
. 
. save "Table 1 Part4.dta", replace 
{txt}(note: file Table 1 Part4.dta not found)
file Table 1 Part4.dta saved

{com}. 
. 
. 
. /* "Table 1 Part4.dta" contents
> 
> Life expectancy at birth % change from 1990 to 2019
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 5
. 
. * Post-neonatal infant mortality rate 1990 2019
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-4.csv", clear 
{res}{text}(16 vars, 12 obs)

{com}. 
. 
. drop measure_id location_id     location_name sex_id age_id metric_id metric_name cause_id
{txt}
{com}. 
. 
. rename measure_name Measure
{res}{txt}
{com}. 
. replace Measure = "Mortality rate" 
{txt}variable {bf}Measure{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str14{sf}
{txt}(12 real changes made)

{com}. 
. 
. rename age_name Age
{res}{txt}
{com}. replace Age = "Post Neonatal"
{txt}(0 real changes made)

{com}. 
. rename val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(12 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(12 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(12 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. gen sex_id_new = .
{txt}(12 missing values generated)

{com}. replace sex_id_new = 1 if sex_name == "Both"
{txt}(4 real changes made)

{com}. replace sex_id_new = 2 if sex_name == "Male"
{txt}(4 real changes made)

{com}. replace sex_id_new = 3 if sex_name == "Female"
{txt}(4 real changes made)

{com}. 
. rename sex_name Sex
{res}{txt}
{com}. replace Sex = "Both sexes" if Sex == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str10{sf}
{txt}(4 real changes made)

{com}. replace Sex = "Males" if Sex == "Male"
{txt}(4 real changes made)

{com}. replace Sex = "Females" if Sex == "Female"
{txt}(4 real changes made)

{com}. 
. sort sex_id_new  
{txt}
{com}. 
. drop sex_id_new  
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. rename year Year
{res}{txt}
{com}. 
. gen sex_id_new = .
{txt}(12 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both"
{txt}(0 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Male"
{txt}(0 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Female"
{txt}(0 real changes made)

{com}. sort sex_id_new 
{txt}
{com}. drop sex_id_new
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(0 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(0 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(0 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. 
. keep if Year == 1990 | Year == 2019
{txt}(6 observations deleted)

{com}. 
. 
. order Measure Age Sex Year Value Lower_UL Upper_UL
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(6 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(2 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(2 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(2 real changes made)

{com}. 
. sort sex_id_new Year
{txt}
{com}. 
. 
. 
. reshape wide Value Lower_UL Upper_UL, i(Measure Age     Sex) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}       6   {txt}->{res}       3
{txt}Number of variables            {res}       9   {txt}->{res}      11
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}Value1990 Value2019
                               Lower_UL   {txt}->   {res}Lower_UL1990 Lower_UL2019
                               Upper_UL   {txt}->   {res}Upper_UL1990 Upper_UL2019
{txt}{hline 77}

{com}. 
. sort sex_id_new
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. label var Value1990     "1990 Value"
{txt}
{com}. label var Lower_UL1990 "1990 Lower_UL"
{txt}
{com}. label var Upper_UL1990 "1990 Upper_UL"
{txt}
{com}. label var Value2019 "2019 Value"
{txt}
{com}. label var Lower_UL2019 "2019 Lower_UL"
{txt}
{com}. label var Upper_UL2019 "2019 Upper_UL"
{txt}
{com}. 
. 
. rename (Value1990 Lower_UL1990 Upper_UL1990 Value2019 Lower_UL2019 Upper_UL2019) ///
> (Y_1990_Value Y_1990_Lower_UL Y_1990_Upper_UL Y_2019_Value Y_2019_Lower_UL Y_2019_Upper_UL)
{res}{txt}
{com}. 
. replace Measure = "Post-neonatal infant mortality"
{txt}variable {bf}Measure{sf} was {bf}{res}str14{sf}{txt} now {bf}{res}str30{sf}
{txt}(3 real changes made)

{com}. 
. drop cause_name
{txt}
{com}. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. 
. save "Table 1 Part5.dta", replace 
{txt}(note: file Table 1 Part5.dta not found)
file Table 1 Part5.dta saved

{com}. 
. 
. /* "Table 1 Part5.dta" contents
> 
> Postneonatal Mortality Rate 1990 and 2019
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 1 Part 6
. 
. * Post-neonatal infant mortality rate, % change 1990 to 2019
. 
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-5.csv", clear 
{res}{text}(17 vars, 3 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-5.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/5399b053ee07e05980e588f9dabf449e
> 
> 
> Data settings:
> 
> Base: Change
> Location: Canada
> Year range: 1990-2019
> 
> Context: Cause
> Age: Post Neonatal
> Metric: Rate
> 
> Measure: Deaths
> Sex: Male, Female, Both
> Cause: Total All Causes
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. 
. 
. drop measure_id location_id     location_name sex_id age_id metric_id metric_name cause_id
{txt}
{com}. 
. 
. rename measure_name Measure
{res}{txt}
{com}. 
. replace Measure = "Mortality rate" 
{txt}variable {bf}Measure{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str14{sf}
{txt}(3 real changes made)

{com}. 
. 
. rename age_name Age
{res}{txt}
{com}. replace Age = "Post Neonatal"
{txt}(0 real changes made)

{com}. 
. 
. * gen percent = proportion * 100
. replace val = val * 100
{txt}(3 real changes made)

{com}. replace upper = upper * 100
{txt}(3 real changes made)

{com}. replace lower = lower * 100
{txt}(3 real changes made)

{com}. 
. 
. rename val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(3 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(3 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(3 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. gen sex_id_new = .
{txt}(3 missing values generated)

{com}. replace sex_id_new = 1 if sex_name == "Both"
{txt}(1 real change made)

{com}. replace sex_id_new = 2 if sex_name == "Male"
{txt}(1 real change made)

{com}. replace sex_id_new = 3 if sex_name == "Female"
{txt}(1 real change made)

{com}. 
. rename sex_name Sex
{res}{txt}
{com}. replace Sex = "Both sexes" if Sex == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str10{sf}
{txt}(1 real change made)

{com}. replace Sex = "Males" if Sex == "Male"
{txt}(1 real change made)

{com}. replace Sex = "Females" if Sex == "Female"
{txt}(1 real change made)

{com}. 
. sort sex_id_new  
{txt}
{com}. 
. drop sex_id_new sex_id_new 
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. 
. 
. gen sex_id_new = .
{txt}(3 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(1 real change made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(1 real change made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(1 real change made)

{com}. 
. sort sex_id_new 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(0 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(0 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(0 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. 
. order Measure Age Sex Value Lower_UL Upper_UL
{txt}
{com}. 
. replace Measure = "Post-neonatal infant mortality"
{txt}variable {bf}Measure{sf} was {bf}{res}str14{sf}{txt} now {bf}{res}str30{sf}
{txt}(3 real changes made)

{com}. 
. drop Lower_UL Upper_UL cause_name year_start year_end
{txt}
{com}. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. 
. save "Table 1 Part6.dta", replace 
{txt}(note: file Table 1 Part6.dta not found)
file Table 1 Part6.dta saved

{com}. 
. 
. /* "Table 1 Part6.dta" contents
> 
> Postneonatal Mortality Rate % change 1990 to 2019
> 
> Both sexes      Males   Females
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************************************************************************
. * merge DALYs, YLLs, YLDs, Base values and relative changes
. 
. use "Table 1 Part1.dta", clear 
{txt}
{com}. 
. merge 1:1 Measure Age Sex using "Table 1 Part2.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              18{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop Year_start Year_end _merge
{txt}
{com}. 
. rename (Value1990 Lower_UL1990 Upper_UL1990 Value2019 Lower_UL2019 Upper_UL2019) ///
> (Y_1990_Value Y_1990_Lower_UL Y_1990_Upper_UL Y_2019_Value Y_2019_Lower_UL Y_2019_Upper_UL)
{res}{txt}
{com}. 
. gen measure_id_new = .
{txt}(18 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(6 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(6 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(6 real changes made)

{com}. 
. gen sex_id_new = .
{txt}(18 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(6 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(6 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(6 real changes made)

{com}. 
. gen age_id_new = .
{txt}(18 missing values generated)

{com}. replace age_id_new = 1 if Age == "All Ages"
{txt}(9 real changes made)

{com}. replace age_id_new = 2 if Age == "Age-standardized"
{txt}(9 real changes made)

{com}. 
. sort measure_id_new age_id_new sex_id_new
{txt}
{com}. drop measure_id_new age_id_new sex_id_new
{txt}
{com}. 
. save "Table 1 Part1and2.dta", replace 
{txt}(note: file Table 1 Part1and2.dta not found)
file Table 1 Part1and2.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. ************************************************************************
. * merge Life expectancy, Base values and relative changes
. 
. use "Table 1 Part3.dta", clear 
{txt}
{com}. 
. merge 1:1 Age Sex using "Table 1 Part4.dta"
{res}{txt}{p 0 7 2}
(note: variable
Measure was 
str15, now str37 to accommodate using data's values)
{p_end}

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}               3{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. sort sex_id_new 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 1 Part3and4.dta", replace 
{txt}(note: file Table 1 Part3and4.dta not found)
file Table 1 Part3and4.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ************************************************************************
. * merge Post-neonatal mortality rate, Base values and relative changes
. 
. use "Table 1 Part5.dta", clear 
{txt}
{com}. 
. merge 1:1 Sex using "Table 1 Part6.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}               3{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. gen sex_id_new = .
{txt}(3 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(1 real change made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(1 real change made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(1 real change made)

{com}. 
. sort sex_id_new 
{txt}
{com}. 
. drop sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 1 Part5and6.dta", replace 
{txt}(note: file Table 1 Part5and6.dta not found)
file Table 1 Part5and6.dta saved

{com}. 
. 
. 
. 
. 
. 
. ************************************************************************
. * append (DALYs, YLLs, YLDs), (Life expectancy), (Post-neonatal mortality rate)
. 
. use "Table 1 Part1and2.dta", clear
{txt}
{com}. 
. append using  "Table 1 Part3and4.dta"
{txt}{p 0 7 2}
(note: variable
Measure was 
str5, now str15 to accommodate using data's values)
{p_end}

{com}. 
. append using  "Table 1 Part5and6.dta"
{txt}{p 0 7 2}
(note: variable
Measure was 
str15, now str30 to accommodate using data's values)
{p_end}

{com}. 
. save "Table 1.dta", replace
{txt}file Table 1.dta saved

{com}. 
. export excel using "Table 1.xlsx", replace firstrow(varlabels)
{res}{txt}file Table 1.xlsx saved

{com}. 
. 
. 
. 
. 
. 
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 1 Part1.dta"
{txt}

{com}. shell rm -r "Table 1 Part1and2.dta"
{txt}

{com}. shell rm -r "Table 1 Part2.dta"
{txt}

{com}. shell rm -r "Table 1 Part3.dta"
{txt}

{com}. shell rm -r "Table 1 Part3and4.dta"
{txt}

{com}. shell rm -r "Table 1 Part4.dta"
{txt}

{com}. shell rm -r "Table 1 Part5.dta"
{txt}

{com}. shell rm -r "Table 1 Part5and6.dta"
{txt}

{com}. shell rm -r "Table 1 Part3.dta"
{txt}
rm: Table 1 Part3.dta: No such file or directory

{com}. shell rm -r "Table 1 Part6.dta"
{txt}

{com}. 
. 
. 
. 
. 
.  
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 1.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 1.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 09:10:30
{txt}{.-}
{smcl}
{txt}{sf}{ul off}