{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 09:10:30
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 2.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. ** Prepares Table 2
. * Table 2: All-age DALY rates per 100,000 in Canada in 1990 and 2019 for major groups of conditions    
. /* The conditions are ordered according to all-age DALYs in Canada in 2019, 
> from highest to lowest burden. 
> Level-1 classification is a broad classification into 3 groups of conditions; 
> Level-2 classification comprises 22 groups of conditions 
> (top 17 are shown because the remainder are rare in Canada). 
> MNC = Maternal, neonatal and communicable diseases; 
> NCD = non-communicable diseases; CKD = chronic kidney disease */
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 2 Part 1: level-1 causes
. * Input data: "IHME-GBD_2019_DATA-21.csv"
. * Output data: "Table 2 Part1.dta"
. 
. ** Table 2 Part 2: level-2 causes
. * Input data: "IHME-GBD_2019_DATA-22.csv"
. * Output data: "Table 2 Part2.dta"
. 
. 
. ** Table 2 Part 3: Percent change 1990-2019 
. * Input data: "IHME-GBD_2019_DATA-23.csv"
. * Output data: "Table 2 Part3.dta"
. 
. 
. 
. ***********************************************************************
. * Prepare Table 2 Part1
. 
. * All-age DALY rates per 100,000 in Canada in 1990 and 2019. level-1 causes
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-21.csv", clear 
{res}{text}(16 vars, 504 obs)

{com}. 
. /* "IHME-GBD_2019_DATA-21.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/0cda6e1af2fdb16b3a2942edaf32a1d6
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: All Ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: level 1 causes (i.e., 3 causes)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-21.dta", replace
{txt}file IHME-GBD_2019_DATA-21.dta saved

{com}. 
. 
. /*
> cause_id        cause_name
> 295     Communicable, maternal, neonatal, and nutritional diseases
> 409     Non-communicable diseases
> 687     Injuries
> */
. 
. keep if cause_id == 295 | cause_id == 409 | cause_id == 687
{txt}(288 observations deleted)

{com}. 
. gen cause_id_new = . 
{txt}(216 missing values generated)

{com}. replace cause_id_new = 1 if cause_name == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 2 if cause_name == "Non-communicable diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 3 if cause_name == "Injuries"
{txt}(72 real changes made)

{com}. 
. replace cause_name = "MNC" if cause_name == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Non-communicable" if cause_name == "Non-communicable diseases"
{txt}(72 real changes made)

{com}. 
. 
. 
. 
. drop measure_id location_id location_name age_id cause_id metric_id metric_name
{txt}
{com}. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(72 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(72 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(72 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(216 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(72 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(72 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(72 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(216 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(108 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(108 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(216 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(72 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(72 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(72 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(216 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(72 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(72 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(72 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(215 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(216 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(215 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(108 observations deleted)

{com}.         
. sort measure_id_new sex_id_new age_id_new Year cause_id_new
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. keep if Measure == "DALYs"
{txt}(72 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(18 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. * gen rank of Value (for DALYs) within Sex-Year combinations
. 
. egen Sex_Year = group(Sex Year), lname(name)
{txt}
{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. sort Sex_Year cause_id_new
{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. 
. 
. 
. keep if Sex == "Both sexes"
{txt}(12 observations deleted)

{com}. 
. drop Sex_Year
{txt}
{com}. 
. order Cause Year Value Lower_UL Upper_UL rank
{txt}
{com}. 
. reshape wide Value Lower_UL Upper_UL rank, i(Cause) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}       6   {txt}->{res}       3
{txt}Number of variables            {res}      14   {txt}->{res}      17
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}Value1990 Value2019
                               Lower_UL   {txt}->   {res}Lower_UL1990 Lower_UL2019
                               Upper_UL   {txt}->   {res}Upper_UL1990 Upper_UL2019
                                   rank   {txt}->   {res}rank1990 rank2019
{txt}{hline 77}

{com}. 
. order rank1990 rank2019, last
{txt}
{com}. 
. sort cause_id_new
{txt}
{com}. 
. gen to = " to "
{txt}
{com}. 
. egen Rank_change = concat(rank1990 to rank2019)
{txt}
{com}. label var Rank_change "Rank change"
{txt}
{com}. 
. label var Value1990     "1990 Value"
{txt}
{com}. label var Lower_UL1990 "1990 Lower_UL"
{txt}
{com}. label var Upper_UL1990 "1990 Upper_UL"
{txt}
{com}. label var Value2019 "2019 Value"
{txt}
{com}. label var Lower_UL2019 "2019 Lower_UL"
{txt}
{com}. label var Upper_UL2019 "2019 Upper_UL"
{txt}
{com}. 
. drop Measure Age Sex cause_id_new
{txt}
{com}. 
. drop rank1990 rank2019 to
{txt}
{com}. 
. 
. save "Table 2 Part1.dta", replace
{txt}(note: file Table 2 Part1.dta not found)
file Table 2 Part1.dta saved

{com}. 
. /* "Table 2 Part1.dta" contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs 
> 
> Both sexes      Males   Females
> 
> All ages        
> 
> level 1 causes (i.e., 3 causes)
> 
> */
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 2 Part2
. 
. * All-age DALY rates per 100,000 in Canada in 1990 and 2019. level-2 causes
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-22.csv", clear 
{res}{text}(16 vars, 1,200 obs)

{com}. 
. /* "IHME-GBD_2019_DATA-22.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/a02d127dfc4f606293148ea261862d35
> 
> Data settings:
> 
> Base: Single
> Location: Canada
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: All Ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY, YLL, YLD
> Sex: Male, Female, Both
> Cause: level 2 causes (17 causes)
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-22.dta", replace
{txt}file IHME-GBD_2019_DATA-22.dta saved

{com}. 
. 
. gen cause_id_new = . 
{txt}(1,200 missing values generated)

{com}. replace cause_id_new = 1 if cause_name == "Neoplasms"
{txt}(72 real changes made)

{com}. replace cause_id_new = 2 if cause_name == "Cardiovascular diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 3 if cause_name == "Musculoskeletal disorders"
{txt}(72 real changes made)

{com}. replace cause_id_new = 4 if cause_name == "Neurological disorders"
{txt}(72 real changes made)

{com}. replace cause_id_new = 5 if cause_name == "Mental disorders"
{txt}(72 real changes made)

{com}. replace cause_id_new = 6 if cause_name == "Other non-communicable diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 7 if cause_name == "Unintentional injuries"
{txt}(72 real changes made)

{com}. replace cause_id_new = 8 if cause_name == "Chronic respiratory diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 9 if cause_name == "Diabetes and kidney diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 10 if cause_name == "Substance use disorders"
{txt}(72 real changes made)

{com}. replace cause_id_new = 11 if cause_name == "Digestive diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 12 if cause_name == "Sense organ diseases"
{txt}(48 real changes made)

{com}. replace cause_id_new = 13 if cause_name == "Self-harm and interpersonal violence"
{txt}(72 real changes made)

{com}. replace cause_id_new = 14 if cause_name == "Skin and subcutaneous diseases"
{txt}(72 real changes made)

{com}. replace cause_id_new = 15 if cause_name == "Transport injuries"
{txt}(72 real changes made)

{com}. replace cause_id_new = 16 if cause_name == "Respiratory infections and tuberculosis"
{txt}(72 real changes made)

{com}. replace cause_id_new = 17 if cause_name == "Maternal and neonatal disorders"
{txt}(72 real changes made)

{com}. 
. 
. replace cause_name = "Neoplasms" if cause_name == "Neoplasms"
{txt}(0 real changes made)

{com}. replace cause_name = "Cardiovascular" if cause_name == "Cardiovascular diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Musculoskeletal" if cause_name == "Musculoskeletal disorders"
{txt}(72 real changes made)

{com}. replace cause_name = "Neurological" if cause_name == "Neurological disorders"
{txt}(72 real changes made)

{com}. replace cause_name = "Mental" if cause_name == "Mental disorders"
{txt}(72 real changes made)

{com}. replace cause_name = "Other NCD" if cause_name == "Other non-communicable diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Unintentional injuries" if cause_name == "Unintentional injuries"
{txt}(0 real changes made)

{com}. replace cause_name = "Chronic respiratory" if cause_name == "Chronic respiratory diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Diabetes & CKD" if cause_name == "Diabetes and kidney diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Substance use" if cause_name == "Substance use disorders"
{txt}(72 real changes made)

{com}. replace cause_name = "Digestive" if cause_name == "Digestive diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Sense organ" if cause_name == "Sense organ diseases"
{txt}(48 real changes made)

{com}. replace cause_name = "Self-harm and violence" if cause_name == "Self-harm and interpersonal violence"
{txt}(72 real changes made)

{com}. replace cause_name = "Skin" if cause_name == "Skin and subcutaneous diseases"
{txt}(72 real changes made)

{com}. replace cause_name = "Transport injuries" if cause_name == "Transport injuries"
{txt}(0 real changes made)

{com}. replace cause_name = "Respiratory infections" if cause_name == "Respiratory infections and tuberculosis"
{txt}(72 real changes made)

{com}. replace cause_name = "Maternal & neonatal" if cause_name == "Maternal and neonatal disorders"
{txt}(72 real changes made)

{com}. 
. 
. drop measure_id location_id location_name age_id cause_id metric_id metric_name
{txt}
{com}. 
. 
. 
. rename cause_name Cause
{res}{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(408 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(408 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(384 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(1,200 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(408 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(384 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(408 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(1,200 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(600 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(600 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(1,200 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(400 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(400 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(400 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(1,200 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(400 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(400 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(400 real changes made)

{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(1,200 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(1,197 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(1,200 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1fc
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(600 observations deleted)

{com}.         
. sort measure_id_new sex_id_new age_id_new Year cause_id_new
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. keep if Measure == "DALYs"
{txt}(396 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(102 observations deleted)

{com}. 
. keep if Year == 1990 | Year == 2019
{txt}(0 observations deleted)

{com}. 
. * gen rank of Value (for DALYs) within Sex-Year combinations
. 
. egen Sex_Year = group(Sex Year), lname(name)
{txt}
{com}. 
. bysort Sex_Year: egen rank = rank(-Value)
{txt}
{com}. 
. sort Sex_Year cause_id_new
{txt}
{com}. 
. label var Sex_Year "Sex-Year group"
{txt}
{com}. label var rank "rank of mean DALYs within Sex-Year group"
{txt}
{com}. 
. 
. 
. 
. keep if Sex == "Both sexes"
{txt}(68 observations deleted)

{com}. 
. drop Sex_Year
{txt}
{com}. 
. order Cause Year Value Lower_UL Upper_UL rank
{txt}
{com}. 
. reshape wide Value Lower_UL Upper_UL rank, i(Cause) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}      34   {txt}->{res}      17
{txt}Number of variables            {res}      14   {txt}->{res}      17
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                  {res}Value   {txt}->   {res}Value1990 Value2019
                               Lower_UL   {txt}->   {res}Lower_UL1990 Lower_UL2019
                               Upper_UL   {txt}->   {res}Upper_UL1990 Upper_UL2019
                                   rank   {txt}->   {res}rank1990 rank2019
{txt}{hline 77}

{com}. 
. sort measure_id_new sex_id_new age_id_new cause_id_new
{txt}
{com}. 
. order rank1990 rank2019, last
{txt}
{com}. 
. gen to = " to "
{txt}
{com}. 
. egen Rank_change = concat(rank1990 to rank2019)
{txt}
{com}. label var Rank_change "Rank change"
{txt}
{com}. 
. label var Value1990     "1990 Value"
{txt}
{com}. label var Lower_UL1990 "1990 Lower_UL"
{txt}
{com}. label var Upper_UL1990 "1990 Upper_UL"
{txt}
{com}. label var Value2019 "2019 Value"
{txt}
{com}. label var Lower_UL2019 "2019 Lower_UL"
{txt}
{com}. label var Upper_UL2019 "2019 Upper_UL"
{txt}
{com}. 
. drop Measure Age Sex cause_id_new
{txt}
{com}. 
. drop rank1990 rank2019 to
{txt}
{com}. 
. drop sex_id measure_id_new age_id_new sex_id_new
{txt}
{com}. 
. save "Table 2 Part2.dta", replace
{txt}(note: file Table 2 Part2.dta not found)
file Table 2 Part2.dta saved

{com}. 
. /* Table 2 Part2.dta" contents
> 
> Base values of 1990 and 2019
> 
> Value   Lower UL        Upper UL
> 
> DALYs 
> 
> Both sexes      Males   Females
> 
> All ages        
> 
>  level 2 causes (17 causes)
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 2 Part3 and Part4
. 
. * All-age DALY rates per 100,000 in Canada in 1990 and 2019. 
. * Percent change 1990-2019: level-1 causes in Part3, level-2 causes in Part4
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-23.csv", clear 
{res}{text}(17 vars, 120 obs)

{com}. 
. /* "IHME-GBD_2019_DATA-23.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/f2873d6c10775d58ae9df924d7b049bd
> 
> Data settings:
> 
> Base: Change
> Location: Canada
> Year range: 1990-2019
> 
> Context: Cause
> Age: All Ages, Age-standardized
> Metric: Rate
> 
> Measure: DALY
> Sex: Male, Female, Both
> Cause: lavel-1 and level-2 causes 
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. save "IHME-GBD_2019_DATA-23.dta", replace
{txt}file IHME-GBD_2019_DATA-23.dta saved

{com}. 
. 
. drop measure_id location_id location_name age_id metric_id metric_name
{txt}
{com}. 
. 
. rename measure_name Measure
{res}{txt}
{com}. replace Measure = "DALYs" if Measure == "DALYs (Disability-Adjusted Life Years)"
{txt}(120 real changes made)

{com}. replace Measure = "YLDs" if Measure == "YLDs (Years Lived with Disability)"
{txt}(0 real changes made)

{com}. replace Measure = "YLLs" if Measure == "YLLs (Years of Life Lost)"
{txt}(0 real changes made)

{com}. qui compress
{txt}
{com}. 
. gen measure_id_new = .
{txt}(120 missing values generated)

{com}. replace measure_id_new = 1 if Measure == "DALYs"
{txt}(120 real changes made)

{com}. replace measure_id_new = 2 if Measure == "YLLs"
{txt}(0 real changes made)

{com}. replace measure_id_new = 3 if Measure == "YLDs"
{txt}(0 real changes made)

{com}. 
. 
. gen age_id_new = .
{txt}(120 missing values generated)

{com}. replace age_id_new = 1 if age_name == "All Ages"
{txt}(60 real changes made)

{com}. replace age_id_new = 2 if age_name == "Age-standardized"
{txt}(60 real changes made)

{com}. 
. 
. gen Sex = ""
{txt}(120 missing values generated)

{com}. replace Sex = "Both sexes" if sex_name == "Both"
{txt}variable {bf}Sex{sf} was {bf}{res}str1{sf}{txt} now {bf}{res}str10{sf}
{txt}(40 real changes made)

{com}. replace Sex = "Males" if sex_name == "Male"
{txt}(40 real changes made)

{com}. replace Sex = "Females" if sex_name == "Female"
{txt}(40 real changes made)

{com}. drop sex_name
{txt}
{com}. 
. 
. gen sex_id_new = .
{txt}(120 missing values generated)

{com}. replace sex_id_new = 1 if Sex == "Both sexes"
{txt}(40 real changes made)

{com}. replace sex_id_new = 2 if Sex == "Males"
{txt}(40 real changes made)

{com}. replace sex_id_new = 3 if Sex == "Females"
{txt}(40 real changes made)

{com}. 
. rename  val change_proportion_mean
{res}{txt}
{com}. rename upper change_proportion_upper
{res}{txt}
{com}. rename lower change_proportion_lower
{res}{txt}
{com}. 
. gen change_percent_mean = change_proportion_mean * 100
{txt}
{com}. gen change_percent_upper = change_proportion_upper * 100
{txt}
{com}. gen change_percent_lower = change_proportion_lower * 100
{txt}
{com}. 
. drop change_proportion_*
{txt}
{com}. 
. rename change_percent_mean Value
{res}{txt}
{com}. rename change_percent_upper Lower_UL
{res}{txt}
{com}. rename change_percent_lower Upper_UL
{res}{txt}
{com}. 
. label var Value "Relative change (%)"
{txt}
{com}. label var Lower_UL "Relative change (%) Lower UL"
{txt}
{com}. label var Upper_UL "Relative change (%) Upper UL"
{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. replace Value = round(Value,0.1)
{txt}(120 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(120 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(120 real changes made)

{com}. format Value Upper_UL Lower_UL %5.1f
{txt}
{com}. 
. rename age_name Age
{res}{txt}
{com}.         
. rename year_start Year_start    
{res}{txt}
{com}. rename year_end Year_end
{res}{txt}
{com}.   
.   
. sort measure_id_new sex_id_new age_id_new 
{txt}
{com}. 
. drop sex_id     measure_id_new age_id_new
{txt}
{com}. 
. order Sex, after(Age)
{txt}
{com}. 
. drop Lower_UL Upper_UL
{txt}
{com}. 
. order Measure Age Sex Value 
{txt}
{com}. 
. keep if Year_start == 1990 & Year_end == 2019 
{txt}(0 observations deleted)

{com}. 
. *
. 
. * save level-1 and level-2 cause_names
. save "IHME-GBD_2019_DATA-23.dta", replace
{txt}file IHME-GBD_2019_DATA-23.dta saved

{com}. 
. * 
. 
. use "IHME-GBD_2019_DATA-23.dta", clear // level-1 causes
{txt}
{com}. 
. keep if cause_id == 295 | cause_id == 409 | cause_id == 687
{txt}(102 observations deleted)

{com}. 
. gen cause_id_new = . 
{txt}(18 missing values generated)

{com}. replace cause_id_new = 1 if cause_name == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 2 if cause_name == "Non-communicable diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 3 if cause_name == "Injuries"
{txt}(6 real changes made)

{com}. sort sex_id_new cause_id_new
{txt}
{com}. 
. replace cause_name = "MNC" if cause_name == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Non-communicable" if cause_name == "Non-communicable diseases"
{txt}(6 real changes made)

{com}. 
. keep if Age == "All Ages"
{txt}(9 observations deleted)

{com}. keep if Sex == "Both sexes"
{txt}(6 observations deleted)

{com}. 
. drop Year_start Year_end sex_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 2 Part3.dta", replace
{txt}(note: file Table 2 Part3.dta not found)
file Table 2 Part3.dta saved

{com}. 
. /*
> Measure Age     Sex     Value   cause_id        cause_name      cause_id_new
> DALYs   All Ages        Both sexes      -22.1   295     MNC     1
> */
. 
. ******
. 
. use "IHME-GBD_2019_DATA-23.dta", clear // level-2 causes
{txt}
{com}. 
. gen cause_id_new = . 
{txt}(120 missing values generated)

{com}. replace cause_id_new = 1 if cause_name == "Neoplasms"
{txt}(6 real changes made)

{com}. replace cause_id_new = 2 if cause_name == "Cardiovascular diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 3 if cause_name == "Musculoskeletal disorders"
{txt}(6 real changes made)

{com}. replace cause_id_new = 4 if cause_name == "Neurological disorders"
{txt}(6 real changes made)

{com}. replace cause_id_new = 5 if cause_name == "Mental disorders"
{txt}(6 real changes made)

{com}. replace cause_id_new = 6 if cause_name == "Other non-communicable diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 7 if cause_name == "Unintentional injuries"
{txt}(6 real changes made)

{com}. replace cause_id_new = 8 if cause_name == "Chronic respiratory diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 9 if cause_name == "Diabetes and kidney diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 10 if cause_name == "Substance use disorders"
{txt}(6 real changes made)

{com}. replace cause_id_new = 11 if cause_name == "Digestive diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 12 if cause_name == "Sense organ diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 13 if cause_name == "Self-harm and interpersonal violence"
{txt}(6 real changes made)

{com}. replace cause_id_new = 14 if cause_name == "Skin and subcutaneous diseases"
{txt}(6 real changes made)

{com}. replace cause_id_new = 15 if cause_name == "Transport injuries"
{txt}(6 real changes made)

{com}. replace cause_id_new = 16 if cause_name == "Respiratory infections and tuberculosis"
{txt}(6 real changes made)

{com}. replace cause_id_new = 17 if cause_name == "Maternal and neonatal disorders"
{txt}(6 real changes made)

{com}. 
. 
. replace cause_name = "Neoplasms" if cause_name == "Neoplasms"
{txt}(0 real changes made)

{com}. replace cause_name = "Cardiovascular" if cause_name == "Cardiovascular diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Musculoskeletal" if cause_name == "Musculoskeletal disorders"
{txt}(6 real changes made)

{com}. replace cause_name = "Neurological" if cause_name == "Neurological disorders"
{txt}(6 real changes made)

{com}. replace cause_name = "Mental" if cause_name == "Mental disorders"
{txt}(6 real changes made)

{com}. replace cause_name = "Other NCD" if cause_name == "Other non-communicable diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Unintentional injuries" if cause_name == "Unintentional injuries"
{txt}(0 real changes made)

{com}. replace cause_name = "Chronic respiratory" if cause_name == "Chronic respiratory diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Diabetes & CKD" if cause_name == "Diabetes and kidney diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Substance use" if cause_name == "Substance use disorders"
{txt}(6 real changes made)

{com}. replace cause_name = "Digestive" if cause_name == "Digestive diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Sense organ" if cause_name == "Sense organ diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Self-harm and violence" if cause_name == "Self-harm and interpersonal violence"
{txt}(6 real changes made)

{com}. replace cause_name = "Skin" if cause_name == "Skin and subcutaneous diseases"
{txt}(6 real changes made)

{com}. replace cause_name = "Transport injuries" if cause_name == "Transport injuries"
{txt}(0 real changes made)

{com}. replace cause_name = "Respiratory infections" if cause_name == "Respiratory infections and tuberculosis"
{txt}(6 real changes made)

{com}. replace cause_name = "Maternal & neonatal" if cause_name == "Maternal and neonatal disorders"
{txt}(6 real changes made)

{com}. 
. keep if cause_id_new != . 
{txt}(18 observations deleted)

{com}. 
. keep if Age == "All Ages"
{txt}(51 observations deleted)

{com}. keep if Sex == "Both sexes"
{txt}(34 observations deleted)

{com}. 
. drop Year_start Year_end sex_id_new cause_id
{txt}
{com}. 
. sort cause_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 2 Part4.dta", replace
{txt}(note: file Table 2 Part4.dta not found)
file Table 2 Part4.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************************
. * append (level 1), (level 2) causes (base values 1990 and 2019, rank change 1990-2019)
. 
. use "Table 2 Part1.dta", clear
{txt}
{com}. 
. append using "Table 2 Part2.dta"
{txt}{p 0 7 2}
(note: variable
Cause was 
str16, now str22 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
Rank_change was 
str6, now str8 to accommodate using data's values)
{p_end}

{com}. 
. drop sex_id measure_id_new age_id_new sex_id_new
{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "Table 2 Part1and2.dta", replace
{txt}(note: file Table 2 Part1and2.dta not found)
file Table 2 Part1and2.dta saved

{com}. 
. 
. 
. 
. 
. 
. 
. 
. *****************************************************************************************
. * append (level 1), (level 2) causes (% change 1990-2019)
. 
. use "Table 2 Part3.dta", clear
{txt}
{com}. 
. append using "Table 2 Part4.dta"
{txt}{p 0 7 2}
(note: variable
cause_name was 
str16, now str22 to accommodate using data's values)
{p_end}

{com}. 
. drop cause_id cause_id_new
{txt}
{com}. 
. gen row = _n
{txt}
{com}. 
. save "Table 2 Part3and4.dta", replace
{txt}(note: file Table 2 Part3and4.dta not found)
file Table 2 Part3and4.dta saved

{com}. 
. 
. 
. 
. 
. 
. *****************************************************************************************
. * merge the two parts above for Table 2
. 
. use "Table 2 Part1and2.dta", replace
{txt}
{com}. 
. merge m:m row using "Table 2 Part3and4.dta"
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}               0
{txt}{col 5}matched{col 30}{res}              20{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge
{txt}
{com}. 
. drop Measure Age Sex cause_name row
{txt}
{com}. 
. rename Value Percent_change
{res}{txt}
{com}. 
. label var Percent_change "Percent change"
{txt}
{com}. 
. order Percent_change, before(Rank_change)
{txt}
{com}. 
. save "Table 2.dta", replace
{txt}file Table 2.dta saved

{com}. 
. export excel using "Table 2.xlsx", replace firstrow(varlabels)
{res}{txt}file Table 2.xlsx saved

{com}. 
. 
. 
. ********
. 
. * remove files no longer needed
. 
. shell rm -r "Table 2 Part1.dta"
{txt}

{com}. shell rm -r "Table 2 Part2.dta"
{txt}

{com}. shell rm -r "Table 2 Part3.dta"
{txt}

{com}. shell rm -r "Table 2 Part4.dta"
{txt}

{com}. shell rm -r "Table 2 Part1and2.dta"
{txt}

{com}. shell rm -r "Table 2 Part3and4.dta"
{txt}

{com}. shell rm -r "IHME-GBD_2019_DATA-23 level1.dta"
{txt}
rm: IHME-GBD_2019_DATA-23 level1.dta: No such file or directory

{com}. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 2.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 09:10:30
{txt}{.-}
{smcl}
{txt}{sf}{ul off}