{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 b.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Apr 2022, 09:10:35
{txt}
{com}. 
. ***************************************************************************
. * This is "do Table 4 b.do"
. 
. * Project: Canada Burden of Disease                                                                        
. * Person: Farshad Pourmalek pourmalek_farshad at yahoo dotcom
. * Time (initial): 2022 March 28
. ***************************************************************************
. 
. 
. 
. ** Prepares Table 4
. * Table 4: Relative (%) changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019 among all high-income countries. 
. 
. * level 1 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate among 36 countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific, Southern Latin America
. 
. 
. * Metadata for input data described below,
. * under each -import delimited using "IHME-GBD_2019_DATA-??.csv"-
. 
. 
. ** Table 4 Part 2: Level 1 Grouping of Conditions, Canada's Rank in 1990 and Rank in 2019 
. * Input data: "IHME-GBD_2019_DATA-52.csv"
. * Output data: "Table 4 Part2.dta"
. 
. 
. 
. 
. 
. 
. ***********************************************************************
. * Prepare Table 4 Part2
. 
. ** Prepares Table 4, Level 1 Grouping of Conditions
. * Table 4: Relative (%) changes in age-standardized DALY rates in Canada and comparator locations 
. * and Canada’s rank in 1990-2019 among all high-income countries. 
. 
. * level 1 causes, Canada's Rank in 1990 and Rank in 2019 for Age-standardized DALYs rate among 36 countries:
. * Canada, United States, Western Europe, Australasia, Asia-Pacific (see below)
. 
. 
. * use input data from /data/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd data
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/data
{txt}
{com}. 
. import delimited using "IHME-GBD_2019_DATA-52.csv", clear 
{res}{text}(16 vars, 576 obs)

{com}. 
. 
. /* "IHME-GBD_2019_DATA-52.csv" Metadata:
> 
> Permalink:
> https://ghdx.healthdata.org/gbd-results-tool?params=gbd-api-2019-permalink/ed41dbdfb950d3a9a64962694105a5dc
> 
> Data settings:
> 
> Base: Single
> Location: 36 countries (See "do Table 4 a.do")
> Year: 1990, 2000, 2010, 2019
> 
> Context: Cause
> Age: Age-standardized
> Metric: Rate
> 
> Measure: DALYs
> Sex: Both
> Cause: level 1
> 
> 
> Download settings: 
> Both IDs and Names 
> (ID = variable_id, Name = variable_name)
> 
> 
> * Countries in Table 4:
> 
> see "do Table 4 a.do"
> 
> 
> */
. 
. 
. * save output data in /output/ folder
. 
. cd .. // Canada-Burden-of-Disease-main
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main
{txt}
{com}. 
. cd output 
{res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output
{txt}
{com}. 
. drop measure_id location_id age_id metric_id metric_name
{txt}
{com}. 
. rename measure_name Measure
{res}{txt}
{com}. 
. order Measure age_name, last
{txt}
{com}. 
. order sex_id sex_name cause_id, last
{txt}
{com}. 
. rename  val Value
{res}{txt}
{com}. rename upper Upper_UL
{res}{txt}
{com}. rename lower Lower_UL
{res}{txt}
{com}. 
. order Upper_UL, after(Lower_UL)
{txt}
{com}. 
. label var Upper_UL "Upper UL"
{txt}
{com}. label var Lower_UL "Lower UL"
{txt}
{com}. 
. replace Value = round(Value,0.01)
{txt}(522 real changes made)

{com}. replace Upper_UL = round(Upper_UL,0.1)
{txt}(572 real changes made)

{com}. replace Lower_UL = round(Lower_UL,0.1)
{txt}(573 real changes made)

{com}. format Value Upper_UL Lower_UL %5.2fc
{txt}
{com}.         
. rename year Year 
{res}{txt}
{com}. 
. rename location_name Location 
{res}{txt}
{com}. 
. 
. 
. sort Location cause_name
{txt}
{com}. 
. rename cause_name Cause
{res}{txt}
{com}. 
. 
. gen cause_id_new = . 
{txt}(576 missing values generated)

{com}. 
. replace cause_id_new = 1 if Cause == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(144 real changes made)

{com}. replace cause_id_new = 2 if Cause == "Non-communicable diseases"
{txt}(144 real changes made)

{com}. replace cause_id_new = 3 if Cause == "Injuries"
{txt}(144 real changes made)

{com}. 
. drop if Cause == "All causes"
{txt}(144 observations deleted)

{com}. 
. sort cause_id_new
{txt}
{com}. 
. replace Cause = "MNC" if Cause == "Communicable, maternal, neonatal, and nutritional diseases"
{txt}(144 real changes made)

{com}. replace Cause = "Non-communicable" if Cause == "Non-communicable diseases"
{txt}(144 real changes made)

{com}. 
. 
. keep if Year == 1990 | Year == 2019
{txt}(216 observations deleted)

{com}. 
. 
. 
. qui compress
{txt}
{com}. 
. keep Location Cause Year Value cause_id_new
{txt}
{com}. 
. order Cause Year Location Value cause_id_new
{txt}
{com}. 
. sort Cause Year Location
{txt}
{com}. 
. 
. bysort Year Cause: egen rank = rank(Value)
{txt}
{com}. 
. label var rank "Canada's rank of mean DALYs within Country-Cause-Year"
{txt}
{com}. 
. sort Year rank
{txt}
{com}. 
. keep if Location == "Canada"
{txt}(210 observations deleted)

{com}. 
. sort Year cause_id_new
{txt}
{com}. 
. drop Location Value
{txt}
{com}. 
. reshape wide rank, i(Cause) j(Year)
{txt}(note: j = 1990 2019)

Data{col 36}long{col 43}->{col 48}wide
{hline 77}
Number of obs.                 {res}       6   {txt}->{res}       3
{txt}Number of variables            {res}       4   {txt}->{res}       4
{txt}j variable (2 values)              {res}Year   {txt}->   (dropped)
xij variables:
                                   {res}rank   {txt}->   {res}rank1990 rank2019
{txt}{hline 77}

{com}. 
. rename rank1990 Rank_in_1990
{res}{txt}
{com}. rename rank2019 Rank_in_2019
{res}{txt}
{com}. 
. label var Rank_in_1990 "Rank in 1990"
{txt}
{com}. label var Rank_in_2019 "Rank in 2019"
{txt}
{com}. 
. sort cause_id_new
{txt}
{com}. 
. 
. drop cause_id_new
{txt}
{com}. 
. qui compress
{txt}
{com}. 
. save "Table 4 Part2.dta", replace 
{txt}(note: file Table 4 Part2.dta not found)
file Table 4 Part2.dta saved

{com}. 
. 
. /* "Table 4 Part2.dta" contents
> 
> 
> 
> DALYs comparator countries
> 
> Both sexes      
> 
> */
. 
. 
. 
. 
. 
. 
. 
. 
. **********************
. 
. view "log Table 4 b.smcl"
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/farshadpourmalek/Downloads/Canada-Burden-of-Disease-main/output/log Table 4 b.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Apr 2022, 09:10:35
{txt}{.-}
{smcl}
{txt}{sf}{ul off}